[{"id":"DC1","hed":"Shooting started when 81-year-old's Camaro carjacked","summary":"An 81-year-old woman was carjacked as she was leaving a pool in Leisureville. She was about to turn the ignition on her white Chevy Camaro when she was approached by two men carrying a knife, so she handed them the keys. Police caught up with the car a short time later. A short chase ensued and the Camaro crashed. officer Conner Haugh approached the car but was nearly struck when the driver hit the gas and the front end swerved. Haugh fired several shots and officer Rayner De Los Rios fired one shot. No one was hurt. Both suspects were arrested.","subjectIds":[216.217]},
{"id":"DC2","hed":"Boynton Burger King robbery leads to chase; suspect shot in the leg","summary":"Boynton Beach police get a call about shots fired during an armed robbery at the Burger King at 1490 SW 8th St. Three suspects had gone into the restaurants wearing masks and holding guns.They ordered customers to the floor. Shots were fired as the suspects left, but no one was injured. Police spotted the suspects' silver Saturn driving away from the fast food restaurant and chased them onto I-95. During a chase with speeds up to 95 mph, an officer said he saw five muzzle flashes from the suspects' car. A bullet struck a Florida Highway Patrol car. The car chase ended when the suspects stopped and ran on foot in Deerfield Beach. Sgt. Philip Hawkins and another officer encountered one of the armed men. He was \"blading\" toward them, meaning he turned his body as if to fire. He didn't shoot. Hawkins fired five shots, hitting him in the leg.  The man wasn't arrested until a short time later.  No gun was found. Hawkins had left his off-duty side job at Muvico to join the pursuit. By the time the chase ended, 20 Boynton Beach units were in Broward County. Despite criticism that the city was left under-covered and that there was no need for Hawkins to have joined the chase, the officers were commended.","subjectIds":[215]},
{"id":"DC3","hed":"Carjacking suspect shot, bitten by dog","summary":"Boynton Beach officer William Muhleisen chased a car down I-95 that had been reported stolen in an armed carjacking.  The chase ended near the Tri-Rail tracks off Okeechobee Boulevard in West Palm Beach.  The officer chased the suspect on foot.  He says the suspect, Sagon Mickletoe Steward, pointed a gun at him. Muhlheisen fired 11 times, hitting Steward once in the shoulder.  Steward was bitten by a police dog and arrested.","subjectIds":[214]},
{"id":"JE01","hed":"Passenger flees traffic stop with gun, deputy climbs fence, fires twice, misses","summary":"PBSO deputy Willie Brookins saw a suspicious vehicle on patrol near Gramercy Park outside Riviera Beach near Haverhill Road. The driver had no seat belt. He pulled the car over and a passenger carrying a handgun ran. Brookins chased. When he climbed a fence, he saw the man, Arthur \"Maurice\" Key, 32, on the ground, holding the gun and pointing it in his direction. He ordered Key to drop the weapon and fired two shots, both of which missed. Key got away but the gun was found nearby. Key was arrested with heroin and other drugs the next day at a hotel. He said he injured his leg climbing the fence and fell twice just before the deputy shot at him.","subjectIds":[230]},
{"id":"JE02","hed":"Deputy investigating drug sales sees gun, fires single shot; suspects take off, avoid arrest","summary":"A PBSO deputy, suspecting drug sales in a Lake Worth neighborhood, approached a Mazda with three people inside. Deputy Patrick Desir said he saw a passenger reach for a gun and point it at him. Desir fired a single shot and the Mazda took off. Deputies found the car later but did not find the people inside.","subjectIds":[268]},
{"id":"KL1","hed":"14-year-old shot after backing up car, hitting police motorcycle","summary":"Lantana police officer Joel Shackelford was driving home when he smelled marijuana from a vehicle driven by John Earl Clemons, 14. Shackelford followed the car to a cul-de-sac and stepped off his motorcycle. Clemons backed up, striking the motorcycle. Shackelford fired. As Clemons pulled away, Shackelford fired again. Clemons was shot once in the back and arrested at the scene.","subjectIds":[228]},
{"id":"KL10","hed":"Officer shoots gunman at St. Lucie fairground","summary":"Working off duty during a bikers event at the St. Lucie fairgrounds, St. Lucie County deputy Richard Stuhr heard gunshots. When he went to investigate, he saw Chad Smith shooting toward a large crowd. Stuhr ordered Smith to drop his gun. Smith turned toward him, and Stuhr fired three shots at Smith, striking him once in the abdomen. ","subjectIds":[211]},
{"id":"KL11","hed":"Man armed with crowbar, tries to rob school vending machine; shot rushing at officer","summary":"Steven Coberly was seen on a surveillance video holding a crowbar about to rob a school vending machine. Deputy Steve Barker and another officer were setting up a perimeter around the school when they started chasing Coberly. When they caught up to him, Coberly held up the crowbar and rushed at Barker, who fired one round, striking Coberly in the shoulder.","subjectIds":[210]},
{"id":"KL12","hed":"Deputy shoots tire to stop fleeing suspect","summary":"St. Lucie County sheriff's deputies working an undercover weed and seed mission noticed Antonio Hernandez, 22, driving out of a heavy gang area with his hands out of the car. When deputies tried to stop Hernandez, he sped away and eventually struck another car.  When deputy Brian Hester ordered Hernandez out of the car, Hernandez started the car again and began to drive the damaged car.  Hester fired one shot at a front tire to stop the car.  Hernandez surrendered.","subjectIds":[209]},
{"id":"KL13","hed":"Suspect guns car's engine, shot three times","summary":"Port St. Lucie Detective Kevan Carmichael was investigating a series of aluminum hurricane shutter thefts when he came across a suspect at a recycling business. When Carmichael tried to speak with Kenneth Canady, Canady started to drive away. Carmichael continued to try and speak with Canady when Canady stopped his car, gunned the engine and lurched toward the detective. Carmichael shot three times, striking Canady all three times and wounding him.","subjectIds":[208]},
{"id":"KL14","hed":"Drug deal gone bad: Suspect flees, drives toward cops, killed","summary":"Fort Pierce officer Ralph Holmes noticed a drug deal. When he approached, one man fled on foot and the other, John Austgen, sped away in a pickup truck. Austgen ignored attempts to stop him and drove into an open field, where he struck two patrol cars and drove toward Holmes and St. Lucie County Sheriff's Detective Keith Pearson. Both men fired at him, killing him.","subjectIds":[207]},
{"id":"KL15","hed":"Suspect flees undercover drug bust, drives toward Fort Pierce officers, wounded","summary":"Fort Pierce police went undercover as drug sellers. Jamel Hair bought marijuana from them. When officers moved in to make an arrest, Hair fled in a car. He accelerated, almost hitting several officers in front of the car, then accelerated in reverse and narrowly missed several officers behind his car. Hair accelerated once again toward the officers at which time three officers -- Fort Pierce officers Roberto Santos, Mike Sheelar and Robb Pettit -- fired. Hair was hit in the thigh and arrested. ","subjectIds":[206]},
{"id":"KL16","hed":"Five shots fired at driver of stolen car, none hit","summary":"A call came in about a stolen car seen leaving the Boynton Lakes Development. When officer Frederick Merkle Jr. tried to stop the car, police said the driver, Antwon (Bailey) Bush, tried to run Merkle over. Merkle shot five rounds at the car. Other officers deployed stop sticks to stop the car. Bush fled on foot but was caught. He had not been shot. ","subjectIds":[205]},
{"id":"KL17","hed":"Driver fleeing arrest shot in hand","summary":"PBSO deputy Steven Strivelli and another officer were conducting drug, vehicle and pedestrian stops in a high crime area of Lake Worth. While they were making an arrest, police said Morris Hunter tried to strike them with his car. Strivelli fired twice, striking Hunter in the hand.","subjectIds":[203]},
{"id":"KL18","hed":"Man won't drop knife, shot four times","summary":"PBSO deputy Daniel Mercier responded to a domestic violence calls and heard Daniel Rhodes yelling and banging a cane knife against a wall. Mercier told Rhodes to drop the knife but Rhodes moved toward the deputy. Mercier said he stepped back and repeated his commands but Rhodes kept moving toward him. Mercier fired four rounds striking Rhodes all four times and killing him.","subjectIds":[201]},
{"id":"KL19","hed":"Wife shot to death trying to stab husband","summary":"Deputies Ryan Reza and Joshua Eley, responding to a domestic call in Lake Worth, found the caller, Josef Orta, being chased by his wife, Angella Falconi. She was trying to stab him with a 13-inch butcher knife. Reza and Eley shot nine times at Falconi, striking her six times, after she refused to put down the knife. She was killed.","subjectIds":[199]},
{"id":"KL2","hed":"Jupiter officers shoot at fleeing driver after traffic stop","summary":"Jupiter Police Officer Don Kowalski stopped a Honda Civic driven by Duan Clayton Smith for speeding. Officers Jonathan Lloyd and  Sally Collins responded as backup. While they questioned him, Smith closed his door, locked it and accelerated in reverse, striking Lloyd's motorcycle. Kowalski tried to open the driver's door, but it was locked so he kicked the window out with his leg. Smith complied with orders to put his hands up, then dropped his hands to the wheel and drove away. Lloyd fired at the car eight times striking Smith in the neck, leg and lower back. The car went across Central Boulevard, across the median and hit a truck.Kowalski said he didn't think the shooting was necessary.","subjectIds":[226]},
{"id":"KL20","hed":"Pot-smoking call leads to struggle, suspect's death","summary":"Responding to a \"suspicious vehicle\" call in which a neighbor said occupants were smoking pot, PBSO deputy Joshua Kushel, his weapon drawn, ordered the passenger, Claude Jolicoeur, to place his hands on the car. Jolicouer ran. Kushel grabbed him by the shirt and the two began to struggle. Sgt. James Hightower arrived to provide backup. As Kushel wrestled Jolicouer to the ground, Kushel says Jolicouer reached for a gun in his waistband. When Hightower tried to take it away, Jolicouer wouldn't release his grip. Kushel fired five times, killing Jolicouer.","subjectIds":[182]},
{"id":"KL21","hed":"Suicidal armed man confronts SWAT team, killed","summary":"Daniel Fuller was dropped off at his parents' house by his wife. After an argument, an extremely agitated Fuller told his parents he was going to kill himself and would shoot any officer who came to the house.  Port St. Lucie police and the SWAT team responded. Fuller hid behind a shed. He came out and walked toward police aggressively holding a gun. Sgt. Paul Grohowski, officer Reece Kilner and Detective Ryan Lodwich, three SWAT team members, fired multiple times at Fuller, killing him.","subjectIds":[179]},
{"id":"KL22","hed":"Bipolar man off his meds throws rocks at deputy, killed","summary":"Michael Camberdella's mom called 911 three times, saying her 18-year-old son, who was off his medicine for bipolar disorder, was out of control. Camberdella had choked his mom and hit his dad. She said  her son would resist a deputy. When deputy William Goldstein arrived, Camberdella was holding a hammer and tree trimmer. Goldstein told him to drop them.  Camberdella did and started advancing toward the deputy . Then he reached into his pocket and started throwing rocks at the deputy. That's when Goldstein fired 11 rounds and one struck Michael in the chest, killing him. ","subjectIds":[178]},
{"id":"KL23","hed":"Fleeing murderer kills K-9, dies as police open fire","summary":"Armando Felipe shot and killed his girlfriend and fled on foot. When deputies came across him, he fled behind a concrete wall. A K-9 dog went through a chain link fence at the end of the wall. Felipe shot the dog twice.  Lt. Richard Burdick and deputies Richard KIaysmat and David Rutherford opened fire, killing Felipe.","subjectIds":[175]},
{"id":"KL24","hed":"Armed carjacking leads to shootout; suspect hit twice, captured","summary":"Deputies were in pursuit of armed carjacking suspect Michael Wallach when Wallach crashed a car and fled on foot, firing at deputies as he ran through a neighborhood. When Cpl. Paul Ellis and another deputy encountered Wallach, Wallach fired and Ellis fired back five times. Deputies Thomas Walton and Leonard Crawford ran into Wallach, who shot at them. Walton returned fire but Crawford didn't because a civilian was nearby. Wallach took cover behind a Chevy Blazer. Deputy Cleveland Gay fired at Wallach five times. Wallach dropped to the ground after Detective Rafael Bejarano came to the scene and fired three times. Wallach was hit in the shoulder and hip. He survived.  ","subjectIds":[172]},
{"id":"KL25","hed":"Pickup vignette///","summary":"PBSO Sgt. Michael Custer was conducting undercover surveillance parked in the parking lot of a plant nursery owned by the Adams family when Seth Adams came home. Seth became verbally combative with Custer and grabbed Custer's neck  At one point, Seth moved toward his truck to retrieve something despite verbal commands not to. As Seth was turning back around, Custer shot him four times.  Seth proceeded to walk onto his family's property and call his brother twice before collapsing to the ground.","subjectIds":[169]},
{"id":"KL26","hed":"Stabbing suspect emerges from bathroom with a knife, shot to death","summary":"Leon Sahakian had just stabbed his girlfriend in Riviera Beach when he fled in a car. Officers followed him to his home in Palm Beach Gardens where they found his ex-wife in a wheelchair and blood everywhere. Once inside, Sahakian grabbed a knife and started cutting himself. Officers tried to use a Taser on him but missed when Sahakian locked himself in the bathroom. Just as officers were about to kick down the door, Sahakian opened it, waving a knife at them. Sgt. Michael D'Andria and officer Joseph Hoffman fired shots at him and one fired a Taser. Sahakian died.","subjectIds":[167]},
{"id":"KL27","hed":"Shooting suspect confronts police with a sword","summary":"West Palm Beach police responded to a shooting at a gas station and an armed suspect. Officers went to a nearby apartment complex to find the suspect, Marcus Neloms III. He shot at officer Rade Momirovich while he was still in his patrol car. The officer returned fire as he got out of his car.  The suspect started to chase the officer with a sword. Officer Covelle Padgett saw Neloms running after Momirovich and fired two shots, killing him. ","subjectIds":[166]},
{"id":"KL28","hed":"Car theft suspect wounded when he fishtails truck toward cop and his dog","summary":"The PBSO auto theft unit was tracking a stolen vehicle. K-9 deputy Charles Hardy was on his way to a perimeter that had been set up when he spotted Justin Heffernan Jr. and his dad running to the truck. Hardy jumped out of his patrol car and told the two to stop. They ignored him and got into the truck. Justin Jr. revved up the engine and fishtailed toward the deputy and his canine because of the sugary sand. Hardy pulled his canine out of the way and started shooting, striking Justin Jr. once in the shoulder. He survived.","subjectIds":[164.165]},
{"id":"KL29","hed":"Credit union shooting: Suspect who fired on police killed","summary":"Christopher Thompson called police and told them that a man holding a rifle was in the parking lot of the credit union. Thompson also told police where he was standing.  When Sgt. William Gale, deputy Charles Booth and another officer arrived, Thompson fired several shots that struck Gale's patrol car. Gale fired back. When they saw Thompson reach for his rifle, they fired multiple shots, killing him.","subjectIds":[156]},
{"id":"KL3","hed":"Accidental discharge in captain's office","summary":"Jupiter Sgt. Nick Scopelitis was in the office of Capt. James Feeney. While he handled Feeney's pistol, Scopelitis accidentally discharged a round, striking the floor.  No injuries.","subjectIds":[]},
{"id":"KL30","hed":"Deputy fires into car, suspect in shooting found drowned six days later","summary":"A vehicle with unknown occupants, being chased by deputies and suspected of involvement in a shooting, drove through the police tape at the shooting scene and toward deputy Reginal Bush. Bush fired his gun and the car crashed into a metal pole. The occupants fled on foot. Six days later, the body of Tabias Felton, thought to be in the car, was found in a nearby canal. The cause of death was drowning. None of Bush's shells were found. ","subjectIds":[266]},
{"id":"KL31","hed":"Fleeing burglary suspect revs engine, shot in neck","summary":"Deputies responded to a home invasion in progress in Royal Palm Beach. When they arrived, they saw two suspects climb a fence. Deputy Eric Bethel fired one shot at one of the suspects, who continued to run. The other suspect, Jamar Anderson, had run outside of the house but retreated and got into a car with the engine running. Another deputy warned Anderson he would shoot. Bethel heard the deputy and came to assist. Anderson revved the engine as if he was going to accelerate.  When Anderson lowered one of his hands, Bethel fired once, shooting him in the lower neck.","subjectIds":[154.265]},
{"id":"KL32","hed":"Burglary suspect moves into defensive posture, shot once","summary":"Deputy Thomas Walton was called to a home invasion in progress. He made his way to the back of the home when he saw Michael Norton leave  through a broken glass door. Norton's hands were hidden under some kind of black cloth.  Walton demanded Norton put up his hands. Norton removed his hands quickly and moved to a defensive position. Walton shot Norton once in the lower torso. Norton survived.","subjectIds":[152]},
{"id":"KL33","hed":"Schizophrenic refused to drop knife, says 'shoot me' and deputy does ","summary":"Deputies, responding to a domestic call, were greeted by Jesus Barreto, holding a knife. Deputies told him to drop the knife and he refused, saying, \"Shoot me, Shoot me.\"  Barreto moved toward deputies when deputy Fraser Austin shot his Taser and and deputy Ryan Reza fired his gun.  Barreto was struck in the chest and died. Barreto was a diagnosed schizophrenic on various prescriptions. One witness said Barreto had just been playing Call of Duty.","subjectIds":[142]},
{"id":"KL34","hed":"Routine traffic stop results in chase, carjacking, police shooting","summary":"Riviera Beach officer Everton Morgan stopped a car for a traffic violation when Robert Robinson got out of driver side rear door and fled on foot. He dropped a magazine on the ground but the officer saw a gun in his hand. Robinson then carjacked a minivan and drove away. Officers pursued him until he abandoned the car. Morgan chased Robinson on foot when he approached a home. Morgan demanded Robinson get on the ground and drop his weapon. Robinson turned and pointed his gun at the officer. Morgan fired once and struck Robinson, wounding him.","subjectIds":[140]},
{"id":"KL35","hed":"Deputy fires twice in hospital at fleeing burglary suspect","summary":"Deputy Latoya Rouse was assigned to watch a burglary suspect who had been hospitalized at Wellington Regional Medical Center. When she put handcuffs on him after a bathroom trip, her key broke and the handcuffs were loose. She asked a hospital employee to watch John Haulotte while she got coffee. Then Haulotte asked for his leg shackles to be adjusted. When Rouse adjusted them, he kicked at her and slipped out of the handcuffs. She chased him through the triage area and the waiting room. Rouse fired two shots, one in each area, striking him once in the thigh, injuring him.","subjectIds":[138]},
{"id":"KL36","hed":"Warning shot fired despite policy","summary":"West Palm Beach officer Joseph Swiderski arrived at the Radio Shack to handle a confrontation between the manager and the father of the manager's baby. Coincidentally, there was another call about a fraud case involving Towond Hatcher, who happened to walk in the store. Hatcher became increasingly upset when the officer asked for his identification.  Hatcher reached for his backpack. Swiderski told him to keep his hands visible. The two then started to move around the store in a cat and mouse manner.  When Hatcher went to reach inside his backpack, Swiderski fired a shot, later calling it a warning shot. Hatcher was not injured during the incident. Firing warning shots is against PBSO policy.","subjectIds":[134]},
{"id":"KL37","hed":"Suicidal woman shot in thigh","summary":"Susan Pacifici told police she drove to Lantana from Port St. Lucie to commit suicide in front of her ex-husband. While she was in her car, she shot one round in the air. She said she wanted deputies to kill her. Pacifici got out of the car, walked toward the \"stick team\" that was in place and pointed her weapon at officers. Deputy Michael Tognacci fired one shot from his rifle, striking her in the thigh. She survived.","subjectIds":[133]},
{"id":"KL38","hed":"One shot fired, misses man with crack cocaine","summary":"West Palm Beach officers responded to a call about loitering and drug sales. When officers arrived, Albert Richards and others fled, and officers Eugene Jones and Jason Morris chased them. Richards dropped a plastic container of crack cocaine. As Jones approached, Richards turned and pointed an item at him. Jones fired one shot, missing Richards. The item Richards was holding was never found.","subjectIds":[132]},
{"id":"KL39","hed":"Pickup vignette///","summary":"Deputy Juvencio Rivera was off duty, driving his wife and 2-year-old child home from the grocery store in his own car when he was cut off by a driver. He suspected the driver was intoxicated and followed him. While calling 911, the occupants in the car fired at him. Rivera returned fire, shooting 5 rounds. Later, the driver, Jean Mila, said he had just heard his brother had been shot. No one was injured.","subjectIds":[118]},
{"id":"KL4","hed":"Sleeping officer reaches for cellphone, fires gun","summary":"Jupiter Officer Michael Salvemini was sleeping when the alarm on his cellphone went off. He reached for the phone but picked up his firearm instead, somehow pulling the trigger and firing one shot into a bedroom wall. No one was injured.","subjectIds":[]},
{"id":"KL40","hed":"Cop chases man loitering outside store, shoots when suspect picks up gun","summary":"West Palm Beach officer Christian Malta and another officer were patroling a high-crime area on Broadway when they approached some men who were loitering outside a store.  When Malta got out of the car, a few of them ran. Malta chased Ralph Pierre when he saw Pierre drop a gun. Pierre went back to retrieve the gun and Malta commanded him not to touch the gun but Pierre retrieved it anyway. When Pierre picked up the gun, Malta said he saw Pierre raise the gun toward him so Malta fired one round. There were no injuries.","subjectIds":[117]},
{"id":"KL41","hed":"Shots fired to free passenger in I-95 car fire","summary":"Boca Raton officer Jimmy Jalil responded to a car fire on I-95. A passenger was still inside the car. After several attempts to break a window using a fire extinguisher, Jalil advised over the radio that he had no other option but to fire his gun to smash the window and save the girl.  He fired two rounds and was able to get the girl out of the car.","subjectIds":[264]},
{"id":"KL42","hed":"Four shots fired at wanted man armed with AR15 rifle","summary":"Deputy Bryan Schumm and another deputy were assigned to locate Andrew Burtschin based on a felony probable cause affidavit. They found his car at a house in Palm Beach Gardens and called him, leaving a voice mail that his car could be forfeited because it was used during a felony. Burtschin came out of the home holding an AR15 assault rifle. Police say he ignored commands to put the rifle down. Schumm fired four rounds, all missing Burtschin, who dropped to the ground. Burtschin later told detectives he had been heading to his car to get his .45-calber gun.","subjectIds":[115]},
{"id":"KL43","hed":"Detective defends home, shoots intruder","summary":"Someone tried to get into Det. William Saunders' Loxahatchee-area home through the sliding glass door while he and his family slept. Saunders shot the intruder in the arm with his personal gun. PBSO responded but wouldn't let a Riviera Beach internal affairs lieutenant into the house. The intruder was not caught.","subjectIds":[263]},
{"id":"KL44","hed":"Teen with Down Syndrome shot by PBSO deputy while driving mom's minivan","summary":"Deputy Jason Franqui responded to a call in Royal Palm Beach about a 17-year-old with Down Syndrome who stole his mom's minivan. He pulled up next to the stopped minivan in the middle of the busy intersection of Okeechobee and Royal Palm Beach boulevards. He positioned his squad car in front of the teen, Jeremy Hutton, who accelerated as Franqui got out of the car. The minivan bumped the patrol car and Franqui opened fire, shooting six rounds as the minivan turned into the intersection. Hutton, hit three times, survived. His family is suing the sheriff's office.","subjectIds":[103]},
{"id":"KL45","hed":"Pickup vignette///","summary":"Deputy Rieger responded to a call about a suspicious car.  Upon arrival David Bennett did not comply with repeated orders to get out of the car.  Bennett was moving his hands a lot.  Rieger shot him several times after he says Bennett went to reach for something.  Rieger feared it was a gun.","subjectIds":[102]},
{"id":"KL46","hed":"Cops open fire on man in bedroom with tot","summary":"Cpl. Paul Ferrell along with the special response team in Okeechobee County went into a home to serve a narcotics search warrant. Once he was inside, Ferrell saw a closed bedroom door. He was about to open the door when Jose Carrillo opened it very quickly and pointed a handgun at Ferrell. Ferrall fired four rounds as he moved out of the way.  No one was injured, but a 17-month-old child was also in the bedroom.The team had been aware that the child was in the house before launching their \"assault plan.\"","subjectIds":[100]},
{"id":"KL47","hed":"Man threatening suicide won't put down what's under towel, shot several times before taking his own life","summary":"The SWAT team responds to a man threatening to commit suicide in Boca Raton. After several hours of failed negotiations, Robert Geiserman comes out of the house with a towel in his hands and lies down against the house. He sits up and points something under the towel at PBSO deputy Jonathan Wildove. Wildove fires several rounds and keeps firing when Geiserman doesn't put down what he's holding. Geiserman takes his own gun, puts it in his mouth and fires one round, killing himself.   ","subjectIds":[99]},
{"id":"KL48","hed":"Sergeant hits passenger in moving car, who was  pointing gun at her","summary":"While patrolling an area off Spanish Trail in Boca Raton, Sgt. Shannon Wendlick noticed a suspicious car and followed it. It pulled into a driveway and when she got out of her patrol car, the driver put the car in reverse, accelerating toward her and hitting her car. She said she saw the passenger pointing a gun at her. She fired multiple rounds, striking passenger Ramon Rosario three times. Rosario survived and another passenger was arrested. The driver fled on foot.","subjectIds":[94,95,96]},
{"id":"KL49","hed":"Sergeant fires at moving car","summary":"While hearing a radio call of a homicide and suspect chase, PBSO Sgt. Neil Honkala positioned himself at an intersection nearby. He planned to use tire deflator devices but heard that the suspects were shooting at police. He armed himself with a shotgun and shot two rounds after the suspects shot at him as they came close. ","subjectIds":[93]},
{"id":"KL5","hed":"Officer accidentally shoots suitcase","summary":"Jupiter officer Roberto Diaz Hernandez was assisting in a suicide call. When he attempted to make the handgun used in the apparant suicide safe, a round discharged, striking a piece of luggage. No injuries.","subjectIds":[]},
{"id":"KL50","hed":"Car in middle of intersection,  suspect tangles with deputies and is killed","summary":"Deputies were called out about a car in the middle of an intersection. When deputies Ramesh Nandlal and Victor Blackman arrived, Richard Montero appeared to be drunk, slumped over on the wheel.  Montero did not want his car to be towed and got angry.  When deputies tried to handcuff Montero, he refused and struggled with both deputies. Deputy Nandlal, on the ground at this point, used his stun gun against Montero but it didn't work. The deputies grew tired, requested backup while struggling. They said Montero was grabbing at Nandlal's gunbelt. Eventually Nandlal shot Montero four times, killing him. ","subjectIds":[92]},
{"id":"KL51","hed":"Suspect takes baton, fights officer; another kills him","summary":"Deputies were serving a warrant when Allen Hunter said he was not going back to jail.  He took a fighting stance when Deputy Ronald Boiuso used a baton to try and subdue him. Hunter took the baton and began to struggle with the officer.  His partner, deputy Krystal Johnston, shot Hunter with her stun gun, but it didn't work. So Boiuso fired three rounds at Hunter, killing him.","subjectIds":[90]},
{"id":"KL52","hed":"Sergeant thinks he sees gun chasing murder suspects up stairs","summary":"A PBSO sergeant fired at two murder suspects as they were fleeing to their apartment. A drug deal involving Wilfredo Castillo and Alexi Santiago went bad, and Santiago ended up shooting and killing a man. Sgt. Michael Tranchant saw them flee in a car and tried to pull them over. But they stopped near their apartment complex and fled on foot. While he was running up the stairs, Tranchant believed one of them turned and aimed a gun at him, and he fired five times, missing them. The gun had been tossed during the car pursuit and was found in the road.","subjectIds":[27.89]},
{"id":"KL53","hed":"Suspects fired upon after fleeing shooting scene","summary":"Sgt. Garry Wilson and officer Cornelius McGriff responded to a call about a man having been shot. Rigaberto Duval and Calvin Stevens then fled in a car, according to police. The car eventually crashed and the suspects fled on foot. One appeared to have a gun in his hand. The officers fired eight rounds between them, but no one was injured.The man, Courtney Johnson, suffered multiple gunshot wounds.","subjectIds":[87]},
{"id":"KL54","hed":"Off-duty officer wounds himself in forearm ","summary":"After arriving home from duty, officer Adnan Raja failed to properly follow the steps to make his weapon safe and left the magazine in the well of the firearm.  He shot himself in the forearm. He was reprimanded in writing.","subjectIds":[86]},
{"id":"KL55","hed":"Man killed while slashing officer with large knives","summary":"On a domestic call, PBSO deputy Terry Wise,  Lt. Marcos Martinez and Sgt. Richard Dempsey found Jerry Collins behind a sliding glass door with large knives in each hand. The woman who had called police was inside. The deputies offered cigarettes if Collins would open the door. He did and Dempsey shot him with a stun gun. It only made Collins angry. He slashed Wise. The other officers fired, striking Collins 15 times and killing him.  ","subjectIds":[85]},
{"id":"KL56","hed":"Suspect confronted after officer slain, escapes gunshots","summary":"Port St. Lucie Sgt. Gary Morales was trying to stop a speeding car when the car halted suddenly. Morales had to veer left to avoid a collision. That's when suspect Eriese Tisdale reportedly ran over to Morales' car and shot him several times, killing him. Deputy Clarence Bennett heard the shots. When he arrived, he saw the suspect pointing the gun at Morales, arm extended. Then the suspect turned and pointed his gun at Bennett. Bennett fired several times but the suspect ducked between cars and took off in his car. Bennett stayed to help Morales as other deputies chased Tisdale before catching him. ","subjectIds":[84]},
{"id":"KL57","hed":"At speeding stop, driver, deputy scuffle; driver shot dead","summary":"Martin County sheriff's deputy Brian Youngblood stopped Gary Vierow for speeding. When he got out of his patrol car, Vierow got out of his car, too, and started to approach the deputy. Youngblood ordered Vierow to get back in the car, but Vierow refused.  The two ended up scuffling on the ground before Youngblood shot Vierow twice, killing him.  ","subjectIds":[50]},
{"id":"KL58","hed":"Deputies approach Lexus SUV when they smelled pot, fatally shoot driver in chase","summary":"Martin County Sheriff's deputy Micah Skowronski approached a Lexus SUV in a Hobe Sound park and smelled marijuana. The driver fled, leading deputies on a chase through neighborhoods at speeds as high as 60 mph. The SUV tried to go through a yard but before it could, deputies tried to block it. The driver backed up and started heading toward Skowronski. That's when Skowronski and Deputy Jack Munsey fired several shots, killing the driver and injuring one of two passengers.  The car had been stolen in Fort Lauderdale.","subjectIds":[46.47]},
{"id":"KL59","hed":"53 shots: Deputies chase, fatally shoot purse-snatching suspect","summary":"Martin County sheriff's deputy Glenn Tuhey snatched a purse from someone at a gas station and fled.  A gas station employee flagged down a deputy who started chasing the suspect.  Several other deputies joined in. At one point, Tuhey hit a parked car and ejected a person sititng in it. Stop sticks were placed on the road but Tuhey continued to elude police.  At one point deputy Willie Weiss fired several shots at Tuhey's front tire. Another deputy fired shots at Tuhey when he felt threatened.  Eventually Tuhey stopped and deputies fearing Tuhey was pointing a gun at them continued to fire. A  total of 53 shots were fired, Tuhey was struck eight times.","subjectIds":[45]},
{"id":"KL6","hed":"Man killed after chase, exchange of gunfire with cops","summary":"Adalberto Martinez was fighting with his girlfriend about his use of prescription drugs. He left the apartment and got a gun out of his pickup, firing a couple of shots. When police tried to stop him, he kept going. Police stopped him on Florida's Turnpike northbound about a mile south of the Beeline Highway.  He put the car in reverse and tried to ram an officer's car. Eventually he opened his car door and fired at police. Sgt. Glenn Wright and officer Thomas Gitto, returning fire, struck and killed Martinez.","subjectIds":[221]},
{"id":"KL60","hed":"Deputy reaches for suspect's car keys, dragged 7 blocks, fatally shoots when car stops","summary":"Martin County sheriff's deputy George McLain stopped Stacey Scales for driving without headlights on. When McClain asked Scales for his driver's license, Scales put the car in motion.  McLain reached into car to turn off ignition and take the keys, and that's when Scales accelerated, dragging McLain about seven blocks before stopping. McLain saw Scales reach down to the floor of car and that's when he shot Scales twice.  McLain saw Scales move and continued firing. Scales died.","subjectIds":[42]},
{"id":"KL61","hed":"Deputy, punched and kicked during traffic stop at mall, fatally shoots passenger","summary":"At the Treasure Coast Mall, Martin County Sheriff's deputy Jason Howard had stopped a truck driven by Francisco Pablo, who was driving erratically. When Howard starting running Pablo's license, his brother, Miguel, started jousting with Pablo. Howard went to break it up when Miguel jumped out and started punching him, at one point knocking Howard off his feet. Francisco and a friend also started kicking the officer. Howard eventually fired two shots, killing Miguel.","subjectIds":[40.41]},
{"id":"KL62","hed":"NEED HEADLINE ///","summary":"While answering a burglary call, deputies received another call about a domestic situation. When they arrived, deputies were met by Stephen Bryant, who was wielding a gun.  Bryant ignored orders to put down the knife and not go inside his ex-girlfriend's apartment.  St. Lucie County Sheriff's deputy Brian Rhodes shot Bryant once in the face.///ALL WRONG","subjectIds":[39]},
{"id":"KL64","hed":"Suspect downed by K-9 shot by deputy; dog dies","summary":"St. Lucie County K-9 Deputy Michael Colton was assisting a call about shots fired.  When he arrived, he saw Barrington Levy flee on foot. Colton released his K-9, Vasko, to catch Levy. Vasko had Levy down in an open field when Colton approached and heard shots. Levy then pointed the gun at Colton.  Colton fired several shots.  When Levy raised his hand again, Colton fired several more.  Levy was struck several times. Vasko was also struck and died later.  ","subjectIds":[28]},
{"id":"KL65","hed":"Deputy accidentally shoots attempted murder suspect during arrest","summary":"Deputy Ronald Stickney saw a driver acting suspicious. When he ran the tag, he discovered the registrant was wanted for several felonies, including attempted first-degree murder. When he attempted to stop the car, the driver fled.  When the car pulled to a stop, Stickney had his gun drawn and accidentally shot Nathan Tompkins while trying to take him into custody.","subjectIds":[26]},
{"id":"KL66","hed":"Robbery suspect chased, pass by neighbors; deputy fires twice ","summary":"A \"be on the look for\" alert (BOLO) went out over a bank robbery.St. Lucie Deputy Tony Smith saw subject's car and followed it into a neighborhood. Eventually, Ronald Cox stopped the car, which had bullet holes, and fled on foot. He looked back at the officers several times and pointed his gun at them before fleeing again. In the chase, Smith came upon Cox, who again pointed his gun directly at the officer. Smith fired twice. Cox ran again through a neighborhood where people were out working or walking around. One lady said hello to the suspect. Cox was eventually caught and taken into custody.","subjectIds":[25]},
{"id":"KL67","hed":"Officer shoots after ATV driver charges him, hoisting him onto handlebars","summary":"Belle Glade officer Howard Seiler saw an ATV driver driving erratically. Soon the driver, Simon Mosley, was on the sidewalk, headed straight for  Seiler. The officer held his hand up to stop him, but Moseley hit him in the chest and Seiler ended up on the handle bars as the ATV headed into traffic. Seiler pulled out his gun, firing three times, wounding Moseley then fell off the ATV. Moseley drove away.","subjectIds":[24]},
{"id":"KL68","hed":"Deputy wounds man in garage with gun; deputies try to talk to him for 4 hours, but he was dead ","summary":"Deputy Christopher Newman and Deputy Edward Lopez responded to a call one afternoon about loud music at a home that was across from an elementary school. When they arrived, the garage door opened and Newman saw Gregory Hill holding a handgun, appearing to raise it. Newman ordered him to drop the gun but he refused.  Hill then began to close the garage; that's when Newman fired four shots, striking Hill three times.  Police, not sure if they struck Hill, set up a barricade, attempting to talk to Hill for four hours before they realized he was dead.","subjectIds":[23]},
{"id":"KL7","hed":"Van hit 14 times but suspects escape injury","summary":"Boynton Beach officers, responding to a burglary at CarMax on High Ridge Road, saw two or three men fleeing toward a maroon Dodge Caravan minivan, which they started with a screwdriver. Driver Gene Autry Hall drove toward the officers and ignored orders to stop. Officer Raymond Lugo fired five shots from a .40-caliber Glock. Officer David Britto fired 12 rounds from his Glock and officer Chad Shane spent six rounds from an AR-15 rifle. They hit the van 14 times but none of its occupants. Hall was sentenced to three years for aggravated assault on a police officer and other charges.","subjectIds":[219]},
{"id":"KL8","hed":"Pickup vignette///","summary":"Deputy Michael Suszczynski was called to a fight at the First and Ten Sports Bar. When Suszczynski arrived, he saw Victor Arango struggling on the ground with another deputy. Suszczynski pulled out a baton to strike Arango, but it is unclear whether he ever hit him.  Suszczynski says he saw a gun in Arango's back waist ban and Arango's right elbow was pulling back, as if he were going for it. Suszczynski fired twice, killing Arango.","subjectIds":[213]},
{"id":"KL9","hed":"Speeding suspect eludes police, rams 2 cars, shot several times","summary":"Marco Margolis was speeding away from a high drug area when deputy Cory Speicker attempted to stop him. A chase ensued. As the supervisor told officers to end the pursuit, Margolis rammed Speicker's car and as the pursuit continued, he struck another deputy's patrol car. Halted by stop sticks, Margolis accelerated as Speicker approached. That's when Speicker, deputy Jason Cannon and Detective John Brady all fired.  Margolis was struck several times but continued to flee before he crashed and tried to run on foot.","subjectIds":[212]},
{"id":"LM1","hed":"Suspected bank robber shoots officer in foot; officers shoot him dead","summary":"Suspected bank robber Calvin Wallace led Boynton Beach police on a chase after officer Eric Reynolds tried to pull him over. Wallace eventually crashed into another car, opened his car door and fired at Reynolds, shooting him in the foot. Reynolds and officer Christopher Munro returned fire, killing him.","subjectIds":[229]},
{"id":"LM10","hed":"Wanted man cornered, killed; fired one shot into his own head","summary":"Mark E. Lewis, wanted for running over and injuring an officer in November 1999, eluded police until Feb. 1, 2000, when he led police on a 15-mile chase that included driving the wrong way on Interstate 95. Boca Raton police Sgt. Norman Floyd and Paul Holland cornered him at Powerline and Glades roads, where they saw him reach for and pull out a gun. They fired 18 times, killing him. Medical examiners found Lewis fired once, into his head, but the bullet didn't kill him.","subjectIds":[204]},
{"id":"LM100","hed":"Man 'freaked out' at DUI stop, puts car in reverse, drags officer; officers fire into car, hitting him","summary":"Boynton Beach police were helping at a DUI saturation patrol when John Flanagan drove up. Officers noticed the smell of marijuana and told him to get out of the car. Flanagan said he \"freaked out\" and put the car in reverse. The car's door was open and it struck and dragged officer Christopher Munro. Munro and officers Daniel Griswold and Cory Gray fired into the car, hitting Flanagan. He stopped and was arrested.","subjectIds":[68]},
{"id":"LM101","hed":"Pickup vignette///","summary":"Palm Beach County deputy Adams Lin was on patrol when he spotted Dontrell Stephens on a bicycle and wanted to stop him. Lin followed him as Stephens went down a street, got off the bicycle and moved between two cars. Lin got out of his patrol car and moved toward Stephens, who had a hand in his pockets and probably trying to discard drugs before Lin caught up to him. The deputy, however, perceived Stephens as going for a gun, and he shot Stephens four times. Stephens was unarmed.","subjectIds":[67]},
{"id":"LM102","hed":"Man in SWAT standoff urges deputies to kill him, steps outside with guns; deputy wounds him ","summary":"Boynton Beach man Timothy Dillon was suicidal and shooting guns into the floor of his home, prompting family and friends to call police. Palm Beach County SWAT officers got into a 5-hour standoff with Dillon, who repeatedly said he wanted to die and urged deputies to kill him. At the end of the standoff, Dillon went outside with two handguns and pointed one at deputies. Deputy Shawn Gordon shot at him four times, hitting him once. Dillon survived.","subjectIds":[66]},
{"id":"LM103","hed":"Man wanted on several warrants drives at officer, shot once","summary":"West Palm Beach police were trying to catch Moses McCray, wanted on multiple warrants and for beating up his girlfriend, when they found him in a car outside a home. When they walked up to his car, McCray drove at the officers and pointed a gun at them. Sgt. Joseph Herb and officer Christian Tomas fired several times, hitting him once.","subjectIds":[65]},
{"id":"LM104","hed":"Mentally ill neighbor confronts, punches deputy in garage; deputy wounds him","summary":"In a bizarre confrontation, a mentally ill Aldo Alvarez walked up to his neighbor, Palm Beach County deputy Joshua McGehee while the deputy was outside his home. Alvarez became angry, balled up his fists and tried to punch McGehee, and the deputy walked back into his garage to get his gun. After repeated warnings to leave and Alvarez continuing to swing at him, McGehee shot Alvarez several times. Alvarez was charged with assault, but was found not mentally competent to stand trial.","subjectIds":[64]},
{"id":"LM105","hed":"Suspected carjacker shot, killed at end of chase after he had hands around his waistband","summary":"Craig Demps carjacked an idling pickup, shoving an 8-year-old out of the vehicle and sparking a police chase. Demps pulled over for a Palm Beach County deputy and got out of the vehicle with his hands up, but then took off running. He hid, crouching, behind a car in a Marriott Hotel parking lot when deputies caught up to him. Demps had his hands around his waistband and didn't show them after several orders. Deputy Valran Venner then shot him twice, killing him, because he said he was afraid Demps was going to pull out a gun. Demps instead was holding a small baggie of drugs.","subjectIds":[63]},
{"id":"LM106","hed":"FAU police shoot man pacing on roof who charged at them with knife","summary":"Two FAU police officers were called after a repairman saw student Nicholas Squire on the roof of a science building on campus. He was pacing back and forth and looking over the edge of the roof as the officers tried to calm him down. At one point, Squire charged at them with a knife. One officer fired a Taser at the same time officer Gary Grande shot Squire twice, wounding him.","subjectIds":[62]},
{"id":"LM107","hed":"Naked man wounded after pointing rifle at neighbor, neighbor's friend","summary":"Two Palm Beach Shores officers shot Adam Brown after the man, who was naked, grabbed a rifle. Brown had appeared at a neighbor's door wearing only a towel around his waist and holding a rifle. He pointed the rifle at the neighbor's friend, then at the neighbor. The friend called police, who arrived a few minutes later. Brown had dropped the weapon, but after repeated warnings, grabbed it. Officers Gordon Lerner and Oscar Gilbert fired 11 times, wounding him.","subjectIds":[61]},
{"id":"LM108","hed":"Suspect shot trying to rob undercover officer holding 20 pounds of pot","summary":"A plan by the West Palm Beach police narcotics squad went awry and led to one person being wounded. Several members of the undercover team planned to sell 20 pounds of marijuana to Authneil Gavin and two other men for $18,000. But when Gavin met them in the Holiday Inn parking lot, he pulled out a gun and tried to rob the undercover officer. The officer said he was police, then pushed Gavin away before shooting three times. Gavin and the other men ran. Other members of the team who were hiding pursued, firing 37 times. Gavin collapsed nearby.","subjectIds":[60]},
{"id":"LM109","hed":"Officer wounds 'suspicious' person who ran, tripped over pants, reached for gun","summary":"Dimitri Smalls was shot by a West Palm Beach officer after he fell and kept reaching for a handgun. Someone in the neighborhood called police, reporting Smalls as \"suspicious.\" Officer Phillip Williams responded and spotted him. Smalls told Williams he was looking for his aunt's house, then turned and ran. Smalls had a handgun in one hand and was holding up his pants with the other. But the pants fell around his ankles, tripping him, and the gun fell out of his hand. He kept reaching for the gun and Williams shot him once, wounding him.","subjectIds":[59]},
{"id":"LM11","hed":"Officer cleaning gun shoots out ceiling light fixture","summary":"Greenacres officer Frank Moncelli returned from patrol duty on March 29, 2001. As he was unloading rounds from his shotgun in the department's roll call room, the weapon jammed. Assuming the gun was empty, he pulled the trigger to clear the jam. The shotgun wasn't empty, and it fired once into the ceiling, putting a hole through a light fixture. It's unclear whether he was disciplined.","subjectIds":[]},
{"id":"LM110","hed":"Off-duty ICE agent shoots suspect holding up McDonald's","summary":"Immigration and Customs Enforcement agent Wilson Pellot-Soto was off-duty and eating with his girlfriend at a McDonald's when Keshaun Fleming walked in dressed as a woman and held up the cashier at gunpoint. People fled the restaurant. The agent went to his car to get a gun, then came inside and told Fleming to drop the gun. Fleming pointed the gun at him and Pellot-Soto fired twice, hitting him once in the hip. He fled the restaurant and collapsed nearby.","subjectIds":[58]},
{"id":"LM111","hed":"Murder suspect fleeing the scene shot after aiming gun at his head, then officer's","summary":"Murder suspect William Dabbs was shot by a Boynton Beach officer while fleeing the scene of the crime, police said. Dabbs, who is accused of killing his boss, had led police on a chase that reached 100 mph. He slowed down at the intersection of Federal Highway and Hypoluxo Road, where officer Jason Llopis was waiting. Dabbs, who had stopped his van in traffic, pointed a handgun at his head and then at Llopis, the officer said. Llopis fired three times, wounding him.","subjectIds":[57]},
{"id":"LM112","hed":"Girlfriend of suspect struck five times in shoot-out with Marshals","summary":"U.S. Marshals accidentally shot a 30-year-old woman during a shootout with the woman's boyfriend. Deputy U.S. Marshal Dan Lee Cata and Sean Sandler plus supervisor Manny Puri were trying to capture Samir Herrera, a violent felon, and were scoping out his Boynton Beach home when girlfriend Janira Calderin pulled up. Herrera came outside and got into the driver's seat, and the marshals decided to arrest him. Herrera pulled out a gun and started shooting, and the marshals returned fire, hitting him and Calderin. She was struck five times. Herrera drove away in the car and crashed nearby. Calderin has filed a lawsuit against the agents.Calderin was not mentioned at all in the state attorney's report.","subjectIds":[55.56]},
{"id":"LM113","hed":"Juno officer fires at truck that rammed patrol car after chase; driver wounded","summary":"Bank robbery suspect Robert Bittle was shot after leading police on a chase. He finally stopped, and Juno Beach officer Christopher Andrews pulled up behind him. Bittle backed up and rammed the patrol car with his truck. Andrews got out and Bittle backed up a second time, toward the officer, according to police. Andrews said he was afraid he was going to be hit, so he fired into the truck. As Bittle drove away, Andrews fired again because, he said, he believed Bittle was reaching for a gun in the truck.","subjectIds":[54]},
{"id":"LM114","hed":"Man fatally shot after he beat officer with his own gun","summary":"A Palm Springs officer and Palm Beach County firefighter shot and killed a man who had beaten a fellow officer unconscious with the officer's own gun. Police were initially called when Mauricio Cruz, 35, stole keys from a nearby restaurant and ran away. Palm Springs officer Douglas Rua tried to stop him with a Taser, but it didn't stop Cruz. Cruz grabbed a planter and hit Rua in the head, knocking him to the ground. Cruz then grabbed the officer's gun and beat him in the head. Firefighter Ed O'Berry saw the struggle and fired at Cruz with his personal handgun after Cruz pointed the officer's gun at him. Officer Joseph DeRogatis arrived and also fired several times, killing Cruz.","subjectIds":[53]},
{"id":"LM115","hed":"Deputy fires at car fleeing fatal hit-and-run, hits passenger","summary":"A Palm Beach County deputy shot at a driver in a fatal hit-and-run crash but hit the passenger instead. Angelo Perez had stolen a Jeep and during the escape, hit and killed a homeless man. Deputy Ralph Paone spotted the stolen car and chased it to a residential neighborhood. Perez backed the car into a driveway, then drove toward the officer. Paone said he commanded Perez to stop, but witnesses didn't hear it. He fired twice into the car, missing Perez but hitting a passenger in the buttocks. Perez was caught and convicted of hitting and killing the homeless man.","subjectIds":[52.262]},
{"id":"LM116","hed":"Teen trying to cash bad check at bank drive-through fatally shot as he tried to flee","summary":"A Palm Springs officer shot and killed a teenager who tried to cash a bad check and get away. Employees at a Bank of America called police while Marc Ariot was parked in one of the bank's drive-through ATM lanes. Officer Douglas Rua showed up and parked in front of the drive-through lanes. He got out of his car and Ariot quickly sped away. Rua felt Ariot's car was moving toward him and fired three shots, killing him. Evidence and witnesses, however, showed that he fired from the side of the car and behind it, indicating that the vehicle was not an immediate threat to him.","subjectIds":[51]},
{"id":"LM117","hed":"Officer wounds man wielding barbecue fork after roommate stabbed","summary":"A Lake Worth officer shot a man who advanced on him while wielding a barbecue fork. Police were called to the man's home for a stabbing and found Alfonzo Velasquez's roommate stabbed and bleeding in the street. Velasquez came out of his home with a barbecue fork and moved on officer Eric Stull and his sergeant. They told him to drop the knife. When he didn't, Stull shot three times, wounding him.","subjectIds":[49]},
{"id":"LM118","hed":"Palm Springs officer wounds man with gun outside taco stand","summary":"A Palm Springs officer shot and wounded a gun-wielding man outside a taco stand. Officers were on routine patrol when they heard a loud argument outside. One of the men, Jaime Pineda, had a gun.The two men had been thrown out of a nightclub nearby for being drunk and arguing and happened to meet up at the taco stand. Police gave Pineda several orders to drop the gun. Officer Brian Dempsey then shot him with a Taser, which didn't stop him. He then fired five times, hitting him twice.","subjectIds":[48]},
{"id":"LM119","hed":"FAU officer wounds student on rampage in parking lot who lunged at and spat on her ","summary":"An FAU officer shot a student who was on a rampage in a dormitory parking lot. Zachary Carroll, 21, was punching car windshields, breaking car mirrors and smashing a stop sign by the time two FAU officers arrived. They tried to calm him down, but he spat on officer Mary Douglas and lunged at her. She fired twice, wounding him.","subjectIds":[44]},
{"id":"LM12","hed":"Man who sought 'suicide by cop' gets his wish","summary":"Michael Young was shot and killed in a wooded area after being seen robbing a Washington Mutual Bank. Palm Beach County Sheriff's Sgt. Scott Smith fired several times after he said Young threatened police with what appeared to be a pipe bomb. Young also shot himself. A note found in Young's motel room indicated he wanted to commit suicide by cop. ","subjectIds":[202]},
{"id":"LM120","hed":"Atlantis officer shoots man trying to grab his gun","summary":"An Atlantis officer shot a man when he tried to grab the officer's weapon.Officer Richard Sluman saw a truck pulled over to the side of the road across from JFK Medical Center. When another officer arrived, he walked up to the car and saw beer bottles and a gun inside. He told the three people inside to get out of the car, and when he began handcuffing them, Salvadore Maldonado tried to grab his gun. Sluman shot him once in the arm.","subjectIds":[43]},
{"id":"LM121","hed":"Lake Worth officer kills man when he won't drop gun","summary":"A Lake Worth officer shot and killed a man who earlier pointed a gun at a motorist. The motorist had called police after Charles Barber II drove past him and pointed a gun. The motorist followed him and saw what happened next. Barber got out of the car and started walking up the street. Officer Lonney Moral pulled up and told Barber several times to drop the gun. Barber didn't drop the gun and Moral fired twice. Barber ran and Moral fired a third time. Barber ran a short distance before he collapsed. Neither police nor prosecutors ever learned why Moral fired - on his lawyer's advice, he declined to give any statement to investigators.","subjectIds":[38]},
{"id":"LM122","hed":"Jupiter officer kills unarmed man in drug sting","summary":"A Jupiter officer shot and killed an unarmed man during an undercover drug sting operation. Officer Paul Bruno was part of a multi-agency operation that included the Drug Enforcement Administration. They planned to arrest suspect Donovan Brooks in a Days Inn parking lot by luring him with $80,000 in marijuana that he could buy. When Brooks arrived, officers swarmed in to arrest him. Bruno said Brooks made a move toward his waistband, prompting Bruno to shoot once, killing him. There were several problems with the investigation, however. Investigators didn't get a statement from Bruno until the next day because he left the crime scene. DEA agents also moved at least one vehicle from the crime scene and tampered with evidence.","subjectIds":[37]},
{"id":"LM123","hed":"Delray officer fatally shoots teen outside school dance when teen won't stop car","summary":"In one of the most controversial police shootings in the past 15 years, rookie Delray Beach officer Darren Cogoni shot and killed 16-year-old Jerrod Miller while the teen was driving through the parking lot of the Delray Full Service Center during a school dance. Miller didn't have a license. The teen tried to get away from Cogoni, who fired twice, hitting him once in the head and killing him. The officer said he fired to prevent Miller from driving into a large group of kids, but none of the 38 witnesses interviewed by police supported his statement. At the time, Cogoni was a probationary employee so he was fired. ","subjectIds":[36]},
{"id":"LM124","hed":"2 drug dealers escape officers at $2 million home; police fire after car comes at them, killing driver","summary":"Delray Beach police shot and killed one man and wounded another while the men were trying to get away from police. Police were called to a $2 million home by its owner, who had previously bought drugs from two men but now wanted them off his property. Officers Daniel Cramer and Jeff Kology arrived and the suspects, Ralph Brown and Paul Stevens, got in their car and tried to escape through the parking lot. In their escape, they drove toward Cramer, who thought he was going to be hit by the car. Cramer and Kology fired 16 times, killing Brown, who was driving, and wounding Stevens.","subjectIds":[34.35]},
{"id":"LM125","hed":"Boca officers fire at fleeing vehicle from intersection; one officer hit in hand","summary":"Two Boca Raton officers tried to pull over suspects in a bank check scam and ended up shooting at them as they fled. Damon Bell stopped the car at an intersection, but when officer Shannon Wendlick walked up to the car, Bell drove to the left to get out of the way. Wendlick fell trying to get out of the way, and she fired a single shot that missed. Officer William Adrian fired several more times at the fleeing vehicle, hitting Bell in the hand. The other rounds shot out the back window and a tire.","subjectIds":[33]},
{"id":"LM126","hed":"Robber with umbrella disguised as gun shot, killed by officer","summary":"Delray Beach officer Richard Jacobson shot and killed a man who used an umbrella disguised as a gun to rob a drug store. William Vosburgh had stolen $3,100 in Oxycontin using an umbrella wrapped in a jacket, which appeared to be a gun. He hopped into a cab, which was pulled over by Jacobson. When Vosburgh got out of the car, he turned toward the officer with the umbrella and coat. Jacobson, believing it to be a gun, fired once, hitting him in the stomach and killing him.","subjectIds":[32]},
{"id":"LM127","hed":"Suspect chased into sugar field pulls out knife; officer shoots him","summary":"Frederick Royal stole shoes and fled, prompting police to chase him into a sugar cane field. Belle Glade officer Timothy Keith struck him with his patrol car. He pulled Royal off the car before Royal tried to run away. Keith grabbed him, and Royal spun around and pulled out a knife, Keith said. He shot Royal once and arrested him. Royal denied having a weapon.","subjectIds":[31]},
{"id":"LM128","hed":"Suicidal man surrounded by officers, shoots himself in chest; sergeant shoots him, killing him","summary":"Daniel Palmer, a young father of three, was suicidal when his father called Lake Worth police. SWAT officers arrived and talked with Palmer for hours, until he walked outside his home with a handgun. At one point, he turned around, pointed the gun at his chest and pulled the trigger. The action prompted Sgt. Charles Kane to fire once, hitting him in the chest and killing him. Kane said he didn't know Palmer had shot himself and was concerned he was shooting at police.","subjectIds":[30]},
{"id":"LM129","hed":"Officer wounds driver who fled hit-and-run ","summary":"A West Palm Beach officer shot a hit-and-run driver who police said drove at him. Officer Anthony Spatara was on the lookout for Gregory Holman's sedan, which had just been involved in a hit-and-run crash. He saw it stopped. When he walked up to the car, he said Holman drove at him, causing him to shoot once, wounding Holman. Holman crashed and was arrested soon after.","subjectIds":[29]},
{"id":"LM13","hed":"Man armed with BB gun, later implicated in slaying, gunned down","summary":"An undercover FBI agent spotted murder and robbery suspect John Wegrich in a shopping center and called police. PBSO deputies responded, and Lt. Jeffrey Calise shot Wegrich after he said Wegrich reached behind his back, as if for a weapon. A BB gun was in his back pocket. Lake Worth police later determined that Wegrich was responsible for his ex-girlfriend's strangling death a few months earlier.","subjectIds":[200]},
{"id":"LM130","hed":"Officer wounds man who slammed him to the ground, kicked him in head","summary":"A Delray Beach officer shot a man in the arm after the man slammed the officer to the ground and kicked him in the head. Officer Michael Kelley was patrolling a housing development when he came across Robin Beckham. Beckham was sitting in a car that had the ignition punched out - a sign the car had been stolen. Beckham got out of the car as ordered, but while Kelley was patting him down, Beckham attacked him, throwing him to the ground and kicking him in the face. Kelley pulled out his gun and fired once, wounding Beckham. ","subjectIds":[22]},
{"id":"LM131","hed":"West Palm officer shoots at man nailing up yard sale signs with hammer","summary":"A West Palm Beach officer shot at and missed a man he thought was a burglar. Officer Gene Picerno was patrolling South Dixie Highway because the area had been hit by burglars recently. He came across Steven Oser, who had just nailed to a light pole a sign advertising his yard sale. Picerno saw Oser with the hammer and believed the man might be a burglar. He shined his patrol car's spotlight on Oser, and Oser, wanting to be compliant with police, started walking toward the car. Picerno got out and said he shouted several times for Oser to stop and drop the hammer. Oser said he didn't hear anything until a gunshot rang out, and he dropped to the ground. West Palm Beach Internal Affairs said videos of the incident \"do not show Mr. Oser acting in an aggressive or threatening manner,\" and they ruled the shooting not justified. Picerno was told about the department's Employee Assistance Program and required to have an interview with the department psychologist before he returned to duty.","subjectIds":[21]},
{"id":"LM132","hed":"Man fatally shot after running at deputy with screwdriver","summary":"A PBSO deputy shot and killed a screwdriver-wielding man after police said he charged the deputy. Deputy Evan Rosenthal responded to a call of an \"armed disturbance\" at an apartment complex in suburban Boca Raton. He arrived and saw Matthew Pollow standing next to a car with a \"very disturbed look on his face,\" according to a police press release. Pollow was asked to take everything out of his pockets and put it on the car, which he did. But as he walked toward Rosenthal, Pollow turned around and grabbed a screwdriver that he'd just removed from his pants and rushed at the deputy. Rosenthal fired, killing him.","subjectIds":[20]},
{"id":"LM133","hed":"Deputy holding suspect at gunpoint tries to holster it but accidentally hits trigger","summary":"Palm Beach County deputy Martin Hubert had a suspect at gunpoint before holstering his weapon. When he did, his gloved index finger slipped inside the trigger guard, causing it to shoot once into the ground. No one was hurt.","subjectIds":[]},
{"id":"LM134","hed":"Deputy's gun fires when he bumps it against table at home","summary":"Palm Beach County deputy Rafael Padilla-Rodriguez was at home when he said he bumped his department-issued weapon against the table, causing it to fire. He was disciplined for not immediately notifying a supervisor; he called Internal Affairs unit instead.","subjectIds":[]},
{"id":"LM135","hed":"Gang task force deputy shoots at suspects who shot at police during car chase","summary":"A Palm Beach County deputy shot at a fleeing robbery suspect during a car chase. Deputy Steven Calabro, then a member of a gang task force, was riding with another deputy and a West Palm Beach officer when they heard West Palm Beach police were pursuing robbery suspects into Riviera Beach. Calabro was in an unmarked vehicle, and they decided to discretely follow the suspects when West Palm Beach police stopped pursuing them. The suspects shot at the officers during the pursuit, and Calabro fired back twice. It's unclear whether the suspects were ever found.","subjectIds":[261]},
{"id":"LM136","hed":"Deputy shoots out light at home of suicidal U.S. Customs agent ","summary":"Two Palm Beach County deputies fired their rifles during a standoff with a suicidal U.S. Customs and Border Protection agent. While outside the home, deputy Jeremy Lamm shot out a yard light with his AR-15 rifle, which could have gone through the walls of the house. The light was letting the suicidal agent see police. Lt. Richard Burdick shot at the agent when he came outside the home and pointed a handgun at deputies. Lamm shot at the light -- a violation of policy -- after Burdick told him to. Lamm also didn't immediately tell a supervisor he had fired the rifle, another violation of policy. The internal affairs division ultimately ruled that he did not violate policy. Burdick was found to have had an unauthorized accessory on his rifle. ","subjectIds":[17]},
{"id":"LM137","hed":"Deputy fires at suspect he says drove his way","summary":"Palm Beach County deputy Jose Carreiro shot twice at a man he said drove at him. Carreiro had tried to pull over the unidentified suspect for speeding. The suspect fled and parked his car in a driveway. When Carreiro approached the car on foot, the suspect drove in the direction of the deputy. The deputy didn't hit the car with his gun.","subjectIds":[260]},
{"id":"LM138","hed":"Deputy fires at carjacking suspect during foot chase, misses","summary":"A Palm Beach County deputy shot at an armed carjacking suspect during a foot pursuit. During the chase, the unnamed deputy said he fired three times when Marcus Steward turned toward him with a handgun. Steward wasn't hit.","subjectIds":[15]},
{"id":"LM139","hed":"Deputy's gun goes off at home in struggle started by stowing it under pillow","summary":"Palm Beach County deputy Arturo Ramirez accidentally fired a round from his department-issued handgun during an argument with his brother-in-law. The incident started when Ramirez's wife didn't like the fact that Ramirez wanted to sleep with the gun under his pillow. Her brother, who was in the home, came to her aid and tried to get the gun from under the pillow. During a struggle over the gun, it went off harmlessly. When police arrived, they found Ramirez had also struck his wife, and he was arrested. He was fired for failing to complete his probationary period at the sheriff's office.","subjectIds":[]},
{"id":"LM14","hed":"Wanted man runs, fights, shot in head","summary":"PBSO Cpl. Dererk Savage pulled over Herbert Wilson on a Belle Glade street on Sept. 15, 2002. Wilson, who was wanted on a warrant for contempt of court, tried to escape, and Savage grabbed him. They fought and Savage shot him in the back of the head. Wilson survived.","subjectIds":[198]},
{"id":"LM140","hed":"Off-duty deputy shoots, kills man in Miami Beach","summary":"Off-duty Palm Beach County deputy Justin Clayton shot and killed a man he said tried to rob him in Miami Beach. Clayton was with his girlfriend and in a lifeguard tower when Nicholas Burdett of Massachusetts approached them, pulled out a knife and demanded money. Clayton ended up shooting him in the stomach, killing him. The Palm Beach County Sheriff's office didn't investigate, saying Clayton was off-duty and acting as a citizen, not an officer. Miami-Dade prosecutors said the shooting was justified.","subjectIds":[14]},
{"id":"LM141","hed":"Suspect fires at deputy, hitting his protective vest; deputy fires back","summary":"Palm Beach County deputy Trevor Watson was shot in the chest while investigating a suspicious person. Watson spotted the suspect walking behind a trailer and stopped to investigate. When he looked around the trailer, the suspect fired once, hitting him in the chest. The round was stopped by his protective vest. Watson returned fire four times. It's unclear whether the suspect was hit. He was never found.","subjectIds":[259]},
{"id":"LM142","hed":"Deputy in chase tries to holster gun, but it fires off a round","summary":"Palm Beach County deputy Adams Lin accidentally fired his weapon while he was chasing a drug suspect. He was running with his gun in his hand when he stopped to holster it so he could climb a fence. While he was holstering it, the gun fired once. Nobody was injured.","subjectIds":[]},
{"id":"LM143","hed":"Deputy accidentally fires rifle into back of patrol car","summary":"Palm Beach County deputy Darren Curci accidentally fired his AR-15 rifle while stowing it in the back of his patrol car after responding to a call. The round went through the back of the patrol car. No one was injured and Curci was recommended for remedial training.","subjectIds":[]},
{"id":"LM144","hed":"Deputy cleaning shotgun at home accidentally fires into ceiling","summary":"Palm Beach County deputy George Long accidentally fired a round into the ceiling of his home while he was cleaning his handgun. No one was injured.","subjectIds":[]},
{"id":"LM145","hed":"Deputy's rifle hits his Taser; gun goes off","summary":"While waiting for backup on a call, Palm Beach County deputy Vidal Rivera slung his AR-15 rifle across his body. The trigger of the rifle struck his Taser, causing the gun to fire once into the ground. Nobody was injured. Rivera was recommended for remedial training.","subjectIds":[]},
{"id":"LM146","hed":"Deputy accidentally shoots himself in hand at home","summary":"Palm Beach County deputy George Mastics accidentally shot himself in the hand while at home. He was treated at a hospital.","subjectIds":[12]},
{"id":"LM147","hed":"Deputy trying to load rifle accidentally fires it","summary":"Palm Beach County deputy Gwendolyn Hudson accidentally fired a round from her AR-15 rifle while she was trying to load it. The round went into the driver's seat of her patrol car. No one was injured.","subjectIds":[]},
{"id":"LM148","hed":"Accidental discharge by deputy at end of chase","summary":"At the end of a pursuit, Palm Beach County deputy Peter Tapia accidentally fired a round from his weapon. He was recommended for remedial training.","subjectIds":[]},
{"id":"LM149","hed":"Deputy checking shotgun points it at ceiling, pulls trigger","summary":"Palm Beach County deputy James Falsia thought he had unloaded his shotgun. He pointed it toward the ceiling and pulled the trigger to check in the department's motor pool. A round went into the ceiling. No one was injured. Falsia received a two-day suspension and remedial training.","subjectIds":[]},
{"id":"LM15","hed":"Three shots fired, suspect never caught","summary":"Several West Palm Beach police officers responded to a burglary at The Cafe Joshua, where they found a man in a stolen white van behind the restaurant. The officers, including Darren Jenne, walked to the van. The driver backed up, almost hitting another officer, and Jenne fired three times at the driver, who sped away. It's unclear whether the driver was hit -- he was never caught.","subjectIds":[267]},
{"id":"LM150","hed":"Deputy dragged by car, shoots 4 times; no one hit","summary":"A Palm Beach County deputy shot at a burglary suspect after the suspect dragged him with a car. Deputy Gerard Morency spotted Jerickson Santiago and a woman trying to break into a car. When he tried to stop them, Santiago got in a car and backed into the deputy, dragging him a short distance. Morency fired four times, with two rounds going into the car. No one was injured. Santiago was arrested after a 25-minute chase. ","subjectIds":[11]},
{"id":"LM151","hed":"Man with knife in chest, pointing gun at deputies, is killed ","summary":"A man accused of killing his ex-girlfriend was shot and wounded after he failed to show up for a court appearance. Palm Beach County deputies were called to his Boynton Beach apartment, where they found him in the bedroom with a knife in his chest. As they approached him, he grabbed a gun and pointed it at them. Deputy Scott Schwab fired once, hitting him in the torso. The wound eventually killed him.","subjectIds":[10]},
{"id":"LM152","hed":"Deputy accidentally fires gun in police station parking lot","summary":"Palm Beach County deputy Brooke Thomas accidentally fired his handgun in the parking lot of his police station. When he was holstering the weapon, his leather holster strap caught in the trigger, causing it to fire.","subjectIds":[]},
{"id":"LM153","hed":"Accidental discharge during struggle to arrest person","summary":"While he was struggling to arrest a suspect, Palm Beach County deputy Timothy McCann accidentally fired his handgun. The round damaged a window frame.","subjectIds":[]},
{"id":"LM154","hed":"Corrections officer pleads guilty to attempted manslaughter for shooting girlfriend","summary":"A Palm Beach County corrections officer shot his girlfriend while the two argued in his car. Deputy James Horne said the shooting was accidental. The girlfriend first told police that he intentionally shot her after she said she was breaking up with him. Then she changed her story to say it was an accident. After his arrest, the sheriff's office fired him. He eventually pleaded guilty to attempted manslaughter.","subjectIds":[9]},
{"id":"LM155","hed":"Deputy accidentally shoots himself in hand as he approached car","summary":"A member of the Palm Beach County Sheriff's office auto task force accidentally shot himself in the hand. Donald Ammon was walking up to a vehicle with someone sleeping inside when he drew his handgun and accidentally shot himself in his right hand.","subjectIds":[8]},
{"id":"LM156","hed":"Corporal's gun goes off during chase","summary":"A Palm Beach County corporal accidentally fired his weapon while running after a suspect. Cpl. Sean Murray was trying to hop over a fence when he fell, causing the gun to fire. No one was injured.","subjectIds":[]},
{"id":"LM157","hed":"Scant detail on deputy's accidental shooting","summary":"Palm Beach County deputy Claudia Labounty accidentally fired her weapon. Further information wasn't available on this incident.","subjectIds":[]},
{"id":"LM158","hed":"Deputy fires 3 times at driver who tried to hit him","summary":"Palm Beach County deputy Carlton Nebergall shot three times at a vehicle whose driver allegedly tried to run over him during a traffic stop.","subjectIds":[258]},
{"id":"LM159","hed":"Deputy fires at man who won't pull over","summary":"Palm Beach County deputy Gerald Propst shot at a man who didn't stop when he tried to pull him over. The man drove for a mile and then stopped. At some point, Propst said the man drove at him, prompting the deputy to fire four times into the car. He surrendered peacefully.","subjectIds":[7]},
{"id":"LM16","hed":"Suicidal ex-boyfriend slain with one shot","summary":"Palm Beach County Sheriff's deputies were called to an apartment by a woman whose ex-boyfriend was trying to break in. The man, Wilmer Sanchez, left, and police found him in the parking lot, where he was holding a gun to his head and threatening to kill himself. As a deputy was trying to calm him down, Lt. Marcos Martinez saw Sanchez point a gun at the deputy, and he fired once, killing Sanchez.","subjectIds":[197]},
{"id":"LM160","hed":"Sheriff's sergeant shoots at moving vehicle","summary":"Palm Beach County Sgt. Kevin Marks shot at a moving vehicle. More information about this incident is not available.","subjectIds":[257]},
{"id":"LM161","hed":"Man backs car into deputy; 2 fire on him as car drove away","summary":"Two Palm Beach County deputies fired on a man after he backed his car into one of them and drove away. Sgt. Richard Dempsey and deputy Michael Tramonte approached a car in a Walgreens parking lot that they suspected had drugs inside. Rashard Simon was in the passenger's seat, but when they approached, he shifted to the driver's seat and backed the car out of a parking space, striking Dempsey. Dempsey and Tramonte fired on the car as Simon was driving away.","subjectIds":[6]},
{"id":"LM162","hed":"Sergeant demoted over accidental shooting","summary":"Palm Beach County Sgt. Barry Trombley received a weeklong suspension and was demoted for an accidental shooting. The agency found he \"failed to handle his duty firearm in a careful and prudent manner.\"","subjectIds":[]},
{"id":"LM163","hed":"Deputy shoots at vehicle during 'felony traffic stop'","summary":"Palm Beach County deputy Jose Martinez shot at a vehicle while conducting a \"felony traffic stop.\" The circumstances surrounding this shooting are unclear.","subjectIds":[256]},
{"id":"LM164","hed":"Deputy reports accidental discharge at home","summary":"Palm Beach County deputy William Thompson accidentally fired his weapon in his home. He was given counseling.","subjectIds":[]},
{"id":"LM165","hed":"Deputy reprimanded for not reporting accidental shooting immediately","summary":"Palm Beach County deputy Charles Robinson received a written reprimand for not immediately reporting an accidental shooting in his home.","subjectIds":[]},
{"id":"LM166","hed":"Man walking out of garage with knife shot, killed","summary":"A West Palm Beach officer shot and killed a burglar who moved toward him with a knife. Officer John Leonard was responding to a call about a suspicious person when he came across Gerald Hollis walking out of someone's garage armed with a knife. Leonard told Hollis to stop, but Hollis moved toward him, prompting the officer to fire once, killing him.","subjectIds":[3]},
{"id":"LM167","hed":"Officer's story doubted by judge in suspect's trial","summary":"West Palm Beach police officer Ian MacVane shot Telly Andrews after the officer said Andrews drove at him. But the judge in Andrews' criminal trial doubted MacVane's story and twice threw out criminal convictions against Andrews. The evidence showed MacVane shot Andrews while the man was driving away from him.","subjectIds":[2]},
{"id":"LM168","hed":"Deputy shoots, kills son in their apartment","summary":"Palm Beach County deputy Shatara Shatara shot and killed his 21-year-old son in their Delray Beach apartment. The circumstances surrounding the incident have not been released.","subjectIds":[1]},
{"id":"LM17","hed":"Man escapes harm but mobile home hit when police start shooting","summary":"Several West Palm Beach police officers were working an extra duty detail at the Tunnel Club when a shooting broke out in the parking lot. Police saw Thomas Markeith Brown, 19, fleeing with a handgun, and officer Anthony Ellis fired several times. Ellis continued to chase him on foot and fired several more times before Brown was caught. None of the rounds hit Brown, but one went through two mobile homes nearby. Brown was found guilty for shooting another teenager in the parking lot.","subjectIds":[196]},
{"id":"LM18","hed":"SWAT team opens fire on man with submachine gun","summary":"The PBSO SWAT team was serving a warrant on the home of Dennis Colombo Jr. when deputies Trenton Thompson and Michael Collister went through the door. Colombo was armed with a MAC-10 submachine gun and the deputies fired when they said he pointed the gun at them. The reports don't mention what weapons the deputies were using or how often they fired. Colombo was killed.","subjectIds":[195]},
{"id":"LM19","hed":"Man off his meds waves pellet gun, shot off roof, killed","summary":"Christopher Skwierc, 18, was off his medications for bipolar disorder and had more than three times the legal driving limit for alcohol in his system when he made a profanity-laced call to 911 requesting medical help. He was waving a pellet gun from the roof of his mother's house when Palm Beach County Sheriff's deputies arrived. Cpl. William McArdle fired once from a shotgun when Skwierc pointed the pellet gun at him. Skwierc fell from the roof and died. McArdle said the pellet gun looked like a real handgun.","subjectIds":[194]},
{"id":"LM2","hed":"Teen fires twice at police through door, kills himself","summary":"Boynton Beach police were sent to the Medication Station drug store on East Woolbright Road after a burglary alarm was triggered by a suspect, later identified as James Connelly, 17. Officers yelled for anyone inside to come out, then went into the building. Officer Robert Thomas' police dog, Zeus, indicated a suspect was behind a storage door. When Thomas grabbed the door handle, Connelly fired twice through the door, hitting Thomas' hand and his protective vest. The officers retreated, and Zeus ran into the storage room door. Connelly shot himself in the head moments later, although medical examiners couldn't tell whether his actions were intentional or accidental. Zeus died in the building after SWAT officers fired nine cannisters of tear gas into the building, which sparked a fire and suffocated the dog.","subjectIds":[227]},
{"id":"LM20","hed":"Jailer reprimanded after shooting inmate who tried to escape","summary":"Palm Beach County jail inmate Paul Monty was taken to Palms West hospital under the supervision of Sgt. Sandra Nealy. When Nealy unclasped one of Monty's leg irons so he could to go to the bathroom, Monty \"attempted to grab her and then ... turned to exit the hospital room,\" according to a police report. Nealy fired twice at him to prevent his escape, and he was struck in the hand. A PBSO review board found she failed to secure him to the bed before unclasping his leg iron.","subjectIds":[193]},
{"id":"LM21","hed":"Rape suspect tries to run over police, shot in the arm","summary":"Palm Beach County Sheriff's deputies were called to the scene of a kidnapping after Charles Pledger, 23, grabbed a woman at gunpoint and raped her in his vehicle. When deputies confronted him, he tried to run them over. When his car stalled, deputy Jamie Roussel reached in and tried to pull him out of the vehicle and eventually fired three times to stop Pledger from running him over. Pledger was hit once in the arm.","subjectIds":[192]},
{"id":"LM22","hed":"Officer shoots car, causes crash, makes arrest","summary":"Undercover Riviera Beach police were selling marijuana out of a duplex when a man bought two bags for $20. The undercover detectives signaled to colleagues to arrest the man. But while the man was being arrested, his friend, Latavius Battie, jumped into their vehicle and drove toward uniformed officer Michael Dodson. Dodson, who thought the vehicle was going to hit him, fired once, into the car's hood. The car crashed and Battie was arrested.","subjectIds":[191]},
{"id":"LM23","hed":"Police fire four times at man with pellet gun but miss","summary":"Emilcar Sadras, 28, went into a Delray Beach Publix and walked out with a cart full of groceries he hadn't paid for. When an employee tried to stop him, Sadras pulled out a pellet gun that looked like a handgun. Delray Beach police caught up to him pushing his cart at a nearby gas station. Officers David Eberhart and Joseph Hart told him to drop his gun; instead, Sadras pointed it at the officers and they fired four times, missing him. He was arrested soon after.","subjectIds":[190]},
{"id":"LM24","hed":"Bank robber flees with $29,000, crashes, shot to death","summary":"Two Palm Beach County Sheriff's deputies followed bank robber Gary Vitt as he left a Wachovia Bank branch with more than $29,000 in cash. They followed him for three miles before he crashed his car near Southern Boulevard and Haverhill Road. Deputy John Barone got out of his car and saw Vitt chamber a round. Barone shot him three times, killing him.","subjectIds":[189]},
{"id":"LM25","hed":"Teen burglary suspect drives toward police, shot in hip","summary":"Palm Beach County Sheriff's deputy Anthony Harrell responded to a call of several teens peering into cars in a parking lot. When he arrived, Preston Whitefield drove away, in his direction. Harrell fired once into the car, hitting Whitefield in the hip.","subjectIds":[188]},
{"id":"LM26","hed":"Husband's odd behavior, move toward gun, leads to fatal shooting","summary":"Stephen Feldman's wife called 911 because her husband was behaving strangely. Palm Beach County Sheriff's deputy Joseph Caroscio responded to their apartment. Feldman had a handgun, which he placed on the kitchen counter after Caroscio told him to. But the deputy shocked him with a Taser, and shot him twice when he ran to the kitchen and grabbed the gun. Feldman died at the hospital.","subjectIds":[187]},
{"id":"LM27","hed":"Undercover drug buy results in missed shot into pickup truck, arrest","summary":"Undercover Port St. Lucie police were selling drugs in a Circle K parking lot when Anthony Freeman, 39, drove up and made a buy. Several officers moved in to arrest him. Freeman, to escape, backed up and hit officer Robert Fonteyn, who fired a single shot into the cab of Freeman's pickup, missing him. Freeman escaped but was caught soon after.","subjectIds":[186]},
{"id":"LM28","hed":"Shot through windshield strikes man armed only with a bottle","summary":"During a joint undercover operation between police and Palm Beach County deputies, the driver of a Cadillac bought cocaine from officers. When officers moved in to arrest him, West Palm Beach officer Joaquin Fonseca believed he saw the rear passenger holding a gun. He told the man to drop the gun and then fired a shot through the windshield, hitting the man, Manu Henry, in the abdomen. Henry did not have a gun; what Fonseca saw was a bottle. Henry was hospitalized for two weeks. Fonseca was cleared because he \"perceived a threat,\" even though he was in error.","subjectIds":[185]},
{"id":"LM29","hed":"Police open fire on vehicle of fleeing suspect but miss","summary":"FBI agent Nesbitt Kuyrkendall was following robbery suspect Rodolfo Sanchez when he called the Palm Beach County Sheriff's Office for help arresting him. They pulled over Sanchez's stolen SUV in a parking lot, and when they got out to arrest him, he backed up toward the officers. Capt. Simon Barnes fired once with a shotgun, deputy Angela Thompson fired several times with a handgun and an unidentified FBI agent, possibly Kuyrkendall, also fired. Sanchez, who wasn't hit, fled the scene and crashed nearby.","subjectIds":[184]},
{"id":"LM3","hed":"Shot fired, misses suspect in pickup truck","summary":"Reggie Troutman took a woman's wallet outside a Boynton Beach Wendy's restaurant and fled in a stolen car, prompting police to chase him to a Delray Beach business park. Troutman tried to steal a pickup truck whose owner was working in the back seat. Officer Chad Shane fired one shot, missing, when Troutman reached into his waistband, Shane said. Troutman was sprayed with pepper spray and shocked with a Taser before being arrested.","subjectIds":[225]},
{"id":"LM30","hed":"Cocaine-fueled escape attempt results in deputy accidentally shooting patrol car","summary":"Palm Beach County deputies responding to a burglary call found Bernard Desilio, who was high on cocaine and had broken a neighbor's window trying to flee an imaginary person who was trying to kill him. Deputies handcuffed him, and he jumped into the driver's seat of a patrol car and tried to drive away. He was shocked with a Taser and pulled out, but a few minutes later he jumped in the driver's seat again. Deputies were trying to get him out when Desilio kicked deputy Christian Scerbo in the chest, knocking him to the ground. Scerbo accidentally pulled the trigger on his handgun, and the round went into the patrol car. Nobody was hit. Desilio was later found not guilty of resisting officers by reason of insanity.","subjectIds":[183]},
{"id":"LM31","hed":"Man with marijuana joint wounded by police after he backs into them","summary":"A team of Palm Beach County deputies were supposed to meet up for dinner before patrolling \"hot spots\" in north county. Six of the deputies were in a van. While they were driving through Riviera Beach, they saw some men drinking beer in front of a convenience store. They stopped and piled out of the van -- without telling their supervisor, their watch commander or Riviera Beach police. While talking to the men, they noticed Allen Lester, 22, sitting in a car in the parking lot. A marijuana cigarette was sitting on the seat. When they started questioning Lester, he put the car in reverse and drove, hitting two deputies. Cpt. Todd Ostuni and deputies Andrea Bufano and Dwayne Thomas shot Lester several times, wounding him, and he crashed in the parking lot. Internal investigators cited the officers for not reporting their location on the radio.","subjectIds":[174]},
{"id":"LM32","hed":"Man killed after he aims gun at his own head, then at SWAT-team member","summary":"Boris Grbic, 50, was acting suicidal and firing a gun in his house, prompting his family members to call police. After a six-hour standoff with police that included Grbic shooting at a police helicopter, Port St. Lucie SWAT members shot tear gas into Grbic's home and went inside. Detective Michael Beath said Grbic had a gun to his head, then cursed police and pointed a gun at him. Beath fired once, hitting him in the head.","subjectIds":[181]},
{"id":"LM33","hed":"Pickup vignette///","summary":"John Garczynski Jr., distraught over his failed marriage, gave his estranged wife a suicide note. She called police, who found him parked in a condominium parking lot. Garczynski had a gun to his head. Rather than wait him out or call SWAT, three Palm Beach County deputies and a Boca Raton officer decided to approach him, demand that he show his hands and smash out the windows. Garczynski turned and pointed his gun at the officers, they said, prompting them to fire 30 rounds. He was struck 10 times and died at the scene. The shooting prompted Sheriff Ric Bradshaw to implement crisis training for deputies.","subjectIds":[180]},
{"id":"LM34","hed":"Suspect in minivan theft drives toward cop, who fires into vehicle but hits nothing","summary":"Palm Beach County deputy Nicholas Lentini spotted a stolen minivan in a parking lot at 1900 Okeechobee Blvd. He placed a tire spike under one of the tires, then waited for the person driving the minivan to return. Kareem Foulks got in the van and backed up over the spikes, puncturing a tire. Lentini ran up to tell him to get out, but Foulks kept backing up and forward in the car, nearly hitting Lentini, who fired several times at Foulks, then got out of the way. Foulks was arrested in the parking lot.","subjectIds":[177]},
{"id":"LM35","hed":"Shooting suspect killed by off-duty cop working security at apartment complex","summary":"Off-duty Riviera Beach officer James Eggers was helping a security guard at an apartment complex when he heard gunshots at a complex nearby. He ran to the scene to see Dexter Monroe walking away from a shooting victim. When Eggers told him to show his hands, Monroe allegedly reached for a handgun in his pocket. That's when Eggers fired once, hitting Monroe in the head, killing him.","subjectIds":[176]},
{"id":"LM36","hed":"Ex-NYC cop killed after waving gun at SWAT team","summary":"Craig Bodie, a former New York cop who was depressed and distraught, went to his estranged wife's house and threatened to kill himself. After a standoff with Palm Beach County deputies that lasted several hours and threats to kill anybody who went inside the home, Bodie walked outside and raised a gun toward SWAT deputies. Deputy Michael Hansen fired once, killing him.","subjectIds":[173]},
{"id":"LM37","hed":"Man stopped for speeding takes off, striking deputy; five shots miss his vehicle","summary":"David J. Coleman was pulled over by Palm Beach County deputies for speeding. But he was evasive, claiming he lost his license. When one deputy reached in the car to grab a mysterious black bag Coleman was holding, he put the car in drive and took off, striking one deputy in the leg. The other fell out of the car. Deputy James Theel fired five times at the fleeing vehicle, missing Coleman.","subjectIds":[171]},
{"id":"LM38","hed":"Armed wife-beating suspect says 'bring it on' before cops shoot him ","summary":"Dennis K. Rock was drunk when he choked his wife to the point she blacked out. Okeechobee County deputies were called to the scene, and Rock was waiting for them with a rifle. He told deputies to \"bring it on,\" and started walking toward them. Cpl. Paul Ferrell told him several times to drop the rifle, eventually firing twice as Rock kept walking toward them, wounding him.","subjectIds":[170]},
{"id":"LM39","hed":"Man flees police, gets shot in the butt","summary":"West Palm Beach Sgt. Kerry Roaf, who was with several officers in unmarked cars, approached several men who were behaving suspiciously in front of an apartment. When he walked up, several men went inside. Melvin Jones, who was locked out, ran. Roaf chased him down the street, until he said Jones turned and pointed a gun at him. Roaf fired once, hitting him in the buttocks. Jones was arrested for aggravated assault and resisting an officer, but was never prosecuted.","subjectIds":[168]},
{"id":"LM4","hed":"Suspect shoots sergeant after I-95 chase, is wounded","summary":"Suspect Tarvis Wilson shot at a group of people in front of a Boynton Beach home, fled and officers persued him on Interstate 95. The chase, which involved three agencies, went into Broward County before ending in a Delray Beach neighborhood. Wilson abandoned his car and fled on foot, shooting at officers and striking Boynton Beach Sgt. Richard McNevin, piercing his protective vest. A state attorney's investigation cleared the officers, citing four in the shooting: Delray Beach Sgt. John Crane-Baker, Boynton Beach Sgt. Henry Crowell and Boynton officers Michael Arco and Matthew Medeiros. Wilson gave up after he was wounded.","subjectIds":[224]},
{"id":"LM40","hed":"Belligerent man pulls out cellphone but deputy saw 'chrome-colored flash'","summary":"Palm Beach County deputy Sgt. Dererk Savage responded to a call of a person with a gun and found two suspects in a car. The passenger was Chester Washington, 29. Several other deputies arrived and told Washington to get out of the car. He complied, but soon became belligerent. One deputy, on Savage's orders, used a Taser on him, causing Washington to fall face first. He began reaching into his pockets while on the ground, pulling out a cellphone and other items. Savage thought he saw a \"chrome-colored flash\" that could be a gun and fired twice, killing him. There was no gun, and other deputies did not see the flash.","subjectIds":[160]},
{"id":"LM41","hed":"Knife-wielding woman with schizophrenia gunned down in her home","summary":"In one of the more controversial shootings by a Palm Beach County officer, deputy Yun \"Jason\" Law shot and killed Marilou Forrest, 56. Forrest was suffering from schizophrenia when her husband called police to have her hospitalized under the state's Baker Act. He told deputies his wife was wielding a knife. when Law and another deputy went in the home, Forrest was in the bathroom. Deputies said she held a knife over her head and moved toward them. Another deputy tried to shock her with a Taser, but it didn't work. Law fired once, hitting her in the chest.","subjectIds":[163]},
{"id":"LM42","hed":"Carjacking kidnapper killed, carjacking victim wounded","summary":"William Bender kidnapped his ex-girlfriend and her new boyfriend in Lantana, then led police on a chase into Broward County. He pulled into a strip mall with deputies from multiple agencies in pursuit, then got out of his car and tried to carjack a car owned by Shirley White, who was on her way to work. Three deputies opened fire on Bender, killing him. Sgt. Michael Thornton fired into White's car, believing White, who was ducking low in the front seat, was Bender. She was struck once in the hip.","subjectIds":[161.162]},
{"id":"LM43","hed":"Off-duty cop on security detail at teen dance fires three times into car","summary":"West Palm Beach police Sgt. Gregory Key was off-duty providing security, in uniform, at a teen dance party when he heard shots in the parking lot. He tried to stop three people in a white Cadillac, but the driver, Patrick Hutchins, kept going. Key fired three times at the car before it got away. No one was injured.","subjectIds":[159]},
{"id":"LM44","hed":"After chase, fusillade of 288 shots kills suspect","summary":"A confrontation at a West Palm Beach gas station prompted Antonio Isaias-Magdaleno to shoot in the air, leading to a 19-mile police chase to Delray Beach, where he fired several rounds at police after his car crashed. Nineteen Palm Beach County deputies and three Boynton Beach officers returned fire at least 288 times, killing him. Nineteen bullets were removed from his body. Police and prosecutors justified the shooting, but found that so many cars in pursuit of the suspect put civilians at risk.","subjectIds":[158]},
{"id":"LM45","hed":"Crash on 95 leads to chase, struggle for cop's gun before officers open fire, kill suspect","summary":"Russell Wallace, who had a recurrence of cancer and a drug habit, crashed into a car at Interstate 95 and Gateway Boulevard and fled. Boynton Beach officers saw the crash and pursued him. Wallace bailed out of his car in the northbound lanes of I-95, then jumped the median into the southbound lanes, where an officer caught and tackled him. In their struggle, Wallace grabbed officer Rocky Zavattaro's gun. Boynton officers David Coffey and Charles Turco shot him five times, killing him.","subjectIds":[157]},
{"id":"LM46","hed":"Robbery suspect fired upon, fires back, no one hit","summary":"Jenard Saulsby, 15, was a suspect in several robberies of cab drivers. When Riviera Beach police moved in to arrest him, police said he reached into his waistband for a gun. Det. Garry Wilson fired once, missing him. Saulsby ran behind a house, where he fired one shot. No one was wounded.","subjectIds":[151]},
{"id":"LM47","hed":"Officer fires to stop fleeing motorist, misses","summary":"Lantana officer Joel Shackelford tried to pull over Katie Lee Vest after he saw her driving erratically. She fled. Shackelford later saw her again, and pursued her into a cul-de-sac. Vest, trying to escape, drove at the officer, and he fired once at the front tire to disable the vehicle. He missed the vehicle and no one was hurt.","subjectIds":[150]},
{"id":"LM48","hed":"Gas station robbery suspect shot five times, survives","summary":"Ira Frierson, 49, got the attention of police when he held up a man at gunpoint in a gas station, then made the man drive around the back of the store. The victim got out and ran to the front, where he found West Palm Beach officer Keith Gorski, who'd been called to the scene by a witness. Gorski went behind the gas station to find Frierson, who pointed a gun at the officer and, at some point, fired it. Gorski fired six times, hitting Frierson five times. He survived.","subjectIds":[149]},
{"id":"LM49","hed":"Man suspected of swiping Porsche drives into officers, is wounded","summary":"When a man got out of his Porsche SUV to get a soda at a gas station, Richard Thevenin noticed the man left his keys in the ignition. Thevenin got in the car and took off, prompting a police chase. At one point he struck several parked police cars and in his haste to get away, struck West Palm Beach officer Jakovos Saridakis and drove at officer Jason Zangara, who both fired several times. Thevenin was struck at least once. He survived.","subjectIds":[148]},
{"id":"LM5","hed":"Trooper at training exercise shoots two colleagues","summary":"Florida Highway Patrol Lt. Jeffrey Johnson accidentally shot fellow troopers Mellow Scheetz and Derrick Rahming following a training exercise at a shooting range. Johnson was trying to demonstrate how to clean a handgun properly. To disassemble his Glock handgun, he pulled the trigger, not realizing a round was in the chamber. Johnson shot Scheetz in the left buttocks, and the round struck two handgun magazines in Rahming's right pants pocket. Scheetz was taken to the hospital and discharged the same day.","subjectIds":[222.223]},
{"id":"LM50","hed":"Man angry at ex, shoots self in the head as police fire upon him","summary":"Jesse Diana, drunk and upset with his ex-girlfriend, grabbed a gun and went to the bar where she worked. He knocked out the windows of the bar, and a friend of the ex-girlfriend called Boca Raton police. Sgt. Sean McGovern and another officer arrived and briefly pursued Diana into the parking lot, where he shot himself in the head. McGovern fired three rounds, hitting him once in the thigh, after seeing Diana raise the gun.","subjectIds":[147]},
{"id":"LM51","hed":"Police fire, miss armed, fleeing erratic driver","summary":"Riviera Beach officer Francisco Aguirre noticed Brian Dicocco driving erratically. When he tried to pull Dicocco over, he fled into a neighborhood, got out of his car and ran. Aguirre and officer Jeremy Summers chased him on foot, firing several times when they said Dicocco turned toward them with a gun. He fled into a home and later was arrested.","subjectIds":[146]},
{"id":"LM52","hed":"Man going 'berserk' grabs gun, shot by deputy before arrest","summary":"The father of Christopher Weiland, 52, called police because his son was going \"berserk.\" Two Palm Beach County deputies responded and coaxed the younger Weiland to walk out of the home with them. But as they were walking out, Weiland darted into a room and grabbed a shotgun. Deputy Michael Johnson quickly fired off a round, hitting Weiland in the hand and thigh, before retreating. Weiland eventually came out of the room unarmed, and he was stunned with a Taser and arrested.","subjectIds":[145]},
{"id":"LM53","hed":"Mumbling man attacks officer, withstands pepper spray, killed","summary":"An apartment complex security guard called police after Vernon Jones, 23, was seen barefoot and mumbling in the neighborhood. When West Palm Beach officer Shawn Phillips arrived, Jones became enraged, immediately punching the officer and hitting him in the head with a lawn ornament. Phillips used pepper spray on Jones during the two-minute struggle, but it had no effect. He eventually pulled out his handgun and shot Jones three times, killing him. Jones might have been mentally ill and had numerous cases of domestic violence.","subjectIds":[141]},
{"id":"LM54","hed":"Bank robber brothers flee, both get shot, one killed","summary":"Brothers and serial bank robbers Brandon and Joshua Beasley were fleeing a bank robbery in a car when Palm Beach County deputies caught up to them in Boynton Beach. They crashed their car into a fire hydrant and fled on foot, with deputies chasing on foot. Cpl. William Kirkpatrick chased Brandon, who was carrying a bag with cash and an AR-15 rifle sticking out. When Brandon made a move toward the bag, Kirkpatrick shot him. Sgt. James Hightower tackled the other brother, who was unarmed. But during the struggle, Joshua grabbed Hightower's gun, and he and three other deputies shot him. Joshua died at the scene.","subjectIds":[143.144]},
{"id":"LM55","hed":"Strip-club drug suspect drives toward deputies, who open fire","summary":"Palm Beach County deputies received information from an informant that Jethro Clairvoyant would be selling drugs in the parking lot of Cheetah's strip club in West Palm Beach. When deputies moved in to arrest him, Clairvoyant tried to get away, driving at deputies in the process. Three deputies and a Boynton Beach K-9 officer fired a total of 33 rounds at him, hitting him three times. Clairvoyant got out of his car, fled on foot and was caught by the police dog.","subjectIds":[139]},
{"id":"LM56","hed":"Discipline recommended for deputy after accidental discharge strikes man in head","summary":"Palm Beach County deputy Sergio Montesino and another deputy responded to a call of several suspicious men in a yard. While the other deputy asked the men for their IDs, Montesino crossed the street to look for other people. Andy Jackson, 22, was hiding behind a car. Montesino told him to stand with his hands up, and Jackson complied. But while putting his flashlight in his belt, Montesino fired his gun accidentally, hitting Jackson in the head. Multiple witnesses, including the other deputy, heard Montesino say immediately after that he didn't mean to shoot. Montesino also initially said it was an accident. But on a second interview, he said he intended to shoot Jackson when Jackson's arms dropped a few inches. Investigators didn't believe him and recommended discipline for the shooting. Jackson survived.","subjectIds":[137]},
{"id":"LM57","hed":"Armed man near nightclub wouldn't drop his gun, officer shoots six times, killing him","summary":"Two Riviera Beach officers were working an off-duty detail providing security at a nightclub when they heard gunshots. They ran to a nearby parking lot, where they saw Tavaris McCullough with a gun. Officer David Torres told him several times to drop his gun, but he didn't. Torres said he raised the gun toward him, and the officer fired six times, killing him.","subjectIds":[136]},
{"id":"LM58","hed":"Police fire at armed robbery suspect, miss ","summary":"Riviera Beach Lts. Anthony Smith and Robert Coppins responded to a robbery call at a Metro PCS store. When they arrived, they saw Kristopher Holloman in a mask and gloves running out of the store. Holloman pointed a handgun at the officers, who each fired once, missing him. Holloman ran back into the store, and later surrendered to officers.","subjectIds":[135]},
{"id":"LM59","hed":"Police try gas, pepper spray, Taser, rubber bullets and bean bag shotgun before wounding suspect","summary":"Arthur Soberon, 30, tried to kidnap a woman, then entered a nearby Boynton Beach home, where he set three fires and stabbed himself several times with a two-foot-long barbecue fork. Boynton Beach SWAT officers tried several times to arrest him, using tear gas, pepper spray, a Taser, rubber bullets and a bean bag shotgun over several hours. They went in a second time and found him submerged in the bathtub, telling police they'd have to kill him. Sgt. David Wier shot him twice, wounding him, when he lunged at officers with the barbecue fork. ","subjectIds":[131]},
{"id":"LM6","hed":"Hiding man wounded after cops search house for drugs","summary":"Delray Beach police SWAT officers served a search warrant for narcotics at the home of John Henry Bean, who ran into a bedroom when officers went inside. Sgt. Richard Jacobson kicked in the door to the bedroom and found Bean inside, armed with a handgun. Police said Bean pointed the weapon at Jacobson, and the officer fired once from his rifle, grazing Bean's shoulder.","subjectIds":[220]},
{"id":"LM60","hed":"Man wandering with machete killed","summary":"Vladimir Niellas was wandering in West Palm Beach while carrying a machete, leading passersby to call police. When officers arrived, he held the machete over his head and moved toward officer Raymond Spinosa, who shot twice, killing Niellas.","subjectIds":[130]},
{"id":"LM61","hed":"Cop chases suspects, trades gunfire","summary":"West Palm Beach officer Sanjay Raja heard gunshots coming from an apartment complex near Haverhill Road and 45th Street and saw a car speeding away. Raja chased the vehicle for four miles on Haverhill before the car stopped at the entrance to an apartment complex and several people got out and started to run away. One of the suspects pointed a handgun at Raja and fired, prompting the officer to return fire. No one was injured. Jacquelin Vilsaint and another man in the car were arrested and convicted for killing two people at the first apartment complex.","subjectIds":[129]},
{"id":"LM62","hed":"Drug deal gone bad, suspect upends cop, is shot in the arm","summary":"Palm Beach County deputies set up Thomas Burgess to sell crack cocaine to a confidential informant. After Burgess arrived in the arranged location -- the parking lot of Paul's Motel -- deputies pounced. Burgess panicked and tried to drive away, striking one undercover deputy, who landed on his head and lost consciousness. Four other deputies opened fire. Burgess surrendered after he was shot once in the arm. Two deputies' names were never released because they were working undercover. ","subjectIds":[128]},
{"id":"LM63","hed":"Cop shoots six times, hits once, wounding armed man","summary":"Riviera Beach police were called to the Stonybrook Apartments after a resident reported a person in the complex with a gun. Officers walked through the complex, then heard several gunshots. They found the gunman, Eugene Auguste, wielding a rifle. Officer Roosevelt Lee yelled at him to drop the weapon, but Auguste stood with the gun facing the officer. Lee fired six times, hitting Auguste once in the hip. Auguste dropped the gun and ran away.","subjectIds":[127]},
{"id":"LM64","hed":"Suspect drives toward police, who shoot but miss","summary":"Riviera Beach police arrived quickly to the scene of a shooting at a house party, in time to see Michael Johnson, 21, shooting out of the window of a car. He sped away from police, but turned back and drove at officers Bertram Fashaw and Cornelius McGriff, who fired several times as he drove toward them and past them. He crashed soon after and was arrested. He was not struck by the officers' rounds.","subjectIds":[126]},
{"id":"LM65","hed":"Undercover agent chases, shoots man with BB gun","summary":"Palm Beach County investigators were investigating a drug operation in the Cinnamon Terrace apartments and assigned an undercover agent to hang out near the pool and watch people coming and going from a specific apartment. When the agent arrived, Alexander Horne, 18, asked him if he wanted drugs. The agent declined. Horne came back a second time with another person and asked the agent again. When the agent declined, Horne pulled out a BB gun and told him to go away. The agent then pulled out a handgun and badge and chased the two men to an apartment. When they were trying to get inside, Horne turned with the gun toward the agent, who fired three times, hitting him twice. He survived. The agent's name has never been released.","subjectIds":[125]},
{"id":"LM66","hed":"Researcher pins cops between cars; eight shots all miss","summary":"Palm Beach County deputies pulled over Bronson Antao, a researcher at a diabetes clinic, after getting calls that he was driving slowly through a nearby apartment complex. They stopped him in the parking lot of a storage center and deputy Lorin Tembeckjian walked toward Antao's car. Antao backed into the deputy, pinning him. The deputy fired seven times into the car, and deputy James Evans fired once. Antao sped off and was captured after a fight. He was found not guilty by reason of insanity. Tembeckjian was not seriously hurt.","subjectIds":[124]},
{"id":"LM67","hed":"Trooper misfires, shoots driver stopped for driving illegally in the carpool lane","summary":"Florida Highway Patrol trooper Barry Radanof accidentally shot 20-year-old Jarrett DeSilva during a traffic stop. DeSilva was driving in the carpool lane illegally and didn't pull over when troopers told him to. When Radanof caught up to him, DeSilva pulled over. Radanof walked to his car with his gun pointed at him and yanked him out of the car. The trooper's gun went off and hit DeSilva in the shoulder. Radanof was given an 80-hour suspension for the incident.","subjectIds":[123]},
{"id":"LM68","hed":"Deputy slays Guatemalan construction worker, commits suicide five weeks later","summary":"The circumstances surrounding this incident are still a mystery, but Palm Beach County deputy Samuel Peixoto stood to be the first officer in the county to be indicted for a police shooting since 1993 had he not committed suicide soon after the shooting. Peixoto pulled over a minivan because the driver was drunk. After the deputy handcuffed the driver and put him in the back seat of his patrol car, he went to the passenger's side to talk to Marino Ramos, a 35-year-old Guatemalan construction worker. Ramos was asleep. Peixoto said he woke the man up, and then Ramos slashed him several times with a butterfly knife, prompting the deputy to shoot him seven times, killing him. But Peixoto couldn't answer basic questions about the incident. An expert said the deputy's knife wounds appeared self-inflicted. And his fingerprint was the only one found on the knife. Peixoto killed himself five weeks later.","subjectIds":[122]},
{"id":"LM69","hed":"Innocent prank? Officer shoots wife in the arm","summary":"An innocent prank went awry when a Riviera Beach officer shot his wife in the arm. Officer Roosevelt Lee was watering his grass when his wife got home early and wanted to scare him by hiding in the laundry room. Lee heard a noise from the closet, went inside and grabbed his handgun. He said nothing and fired once through the door, hitting her in the arm. Lee drove her to the hospital and she recovered. Broward Sheriff's Office investigators never saw the inside of the home. Lee never consented to a search, based on his lawyer's advice, and prosecutors wouldn't grant a search warrant since the shooting appeared accidental.","subjectIds":[121]},
{"id":"LM7","hed":"Suspect in crack deal falls into officer who fires by accident","summary":"Delray Beach police narcotics officer Dave Chin accidentally fired his weapon during an arrest. Chin and several other officers, guns pulled, swarmed the car of a man suspected of buying $100 of crack cocaine. When Chin pulled one of the suspects out of the car, the suspect tripped into the officer. Chin squeezed the trigger on his handgun. No one was injured, and Chin was issued a written reprimand.","subjectIds":[]},
{"id":"LM70","hed":"Pickup vignette///","summary":"Palm Beach County Sheriff's deputy Eric Bethel shot 16-year-old Ruben Debrosse in one of the county's most controversial police killings. Debrosse was driving a stolen rental car when he was stopped in a movie theater parking lot. The teen backed his car into the front of the police cruiser, then pulled forward and backed up again. Bethel, who got out of his car when it was first struck, fired once as the car backed up. Then he said he fired three more times as the car pulled forward again, away from him. The reports don't mention any justification for shooting at the car when it was moving away from him, however. The sheriff's office settled a lawsuit for $200,000.","subjectIds":[120]},
{"id":"LM71","hed":"Man shoots two, struggles with deputy who shoots him seven times","summary":"Palm Beach County deputies were called to a tow yard for an unruly man who wanted to get into a towed car. By the time deputy William Badala arrived, Edward Voltz had shot up the business office, wounding two employees. Badala saw Voltz walking back to his car and ordered him to drop his rifle. Instead, Voltz opened his car door, and Badala grabbed him and tried to disarm him. During the ensuing struggle, Voltz pointed the rifle several times at Badala, who ended up shooting him seven times, wounding him.","subjectIds":[119]},
{"id":"LM72","hed":"Mentally ill man killed when he wouldn't get out of mom's car","summary":"Palm Beach County Sheriff's Cpl. Richard Logsdon mistakenly shot Adam Phillips, a 30-year-old with a history of drug abuse and mental illness, during a traffic stop. Phillips had stolen his mother's car, and deputies spotted it. Phillips never fled from cops, but stopped when the car broke down. He didn't get out of the car when told by deputies. When they approached the car, Logsdon said he saw Phillips make a \"furtive\" movement behind the car's heavily tinted windows and fired several times, killing Phillips instantly. Phillips was unarmed.","subjectIds":[114]},
{"id":"LM73","hed":"Fleeing Walmart shoplifter, passenger wounded after driving toward deputy","summary":"Palm Beach County deputy Thomas Laroche shot a driver and his passenger after the driver drove toward him. Laroche was providing off-duty security at a Walmart when Broderick Hay, 50, stole from the store and ran to his Jeep, which was idling in the parking lot. Mary Gamble, 42, was in the passenger seat. As Hay drove out of the parking lot, Laroche stood in his way, ordering him to stop. Hay didn't stop, instead turning to avoid hitting the deputy, and Laroche fired several times before jumping out of the way. The rounds wounded both Hay and Gamble.","subjectIds":[112.113]},
{"id":"LM74","hed":"Teen rams cop with car, shot in shoulder","summary":"Riviera Beach officers pursued a gun-wielding suspect in a car to Avenue T, where the driver, Alexander James, 16, stopped abruptly. Officer William Saunders crashed into the back of the car and got out. A passenger in the suspect's vehicle got out and ran away. James put his vehicle into reverse and backed into Saunders, who was struck in the leg. The officer fired once to stop James, who was hit in the shoulder.","subjectIds":[111]},
{"id":"LM75","hed":"Man who didn't belong in neighborhood gunned down during chase","summary":"West Palm Beach officer Craig Davis shot and killed known gang associate Dijon Williams when Davis said the man pointed a gun at him during a foot chase. Davis was driving around in an undercover car with another officer when they saw Williams and another man walking in the neighborhood. Williams didn't belong in the neighborhood, Davis later said, and the two officers got out of the car to talk to them. Both men ran when they saw the officers, and during a foot chase, Davis said Williams pointed a handgun at him. Davis fired five times. Williams was expected to survive, but complications during surgery claimed his life. ","subjectIds":[110]},
{"id":"LM76","hed":"Vietnam veteran opens door with rifle in hand, shot by deputies","summary":"A Delray Beach-area neighbor and friend called police to check on Dallas Adkins, a 59-year-old Vietnam veteran, because he was suicidal. When three Palm Beach County deputies arrived, Adkins opened the door with a rifle in his hand. Sgt. Celso Otero and deputy Phil Hernandez fired several times, wounding him. Adkins died several months later in the hospital. Although police initially said Adkins fired on deputies, they later said he did not shoot.","subjectIds":[109]},
{"id":"LM77","hed":"Circle K robbery suspect with BB gun killed by shot to the head","summary":"One teen was shot and killed and another was wounded after police interrupted a robbery at a Circle K on Congress Avenue in Palm Beach County. A customer at the store called police after seeing the men don ski masks in the parking lot. PBSO deputies arrived, and Javery Holliday and Derrick Mortin, both 18, ran out of the store after holding up the cashier. Holliday had a BB gun that looked like a handgun, and deputy Kevin Drummond shot at him as he ran toward him. Holliday hid behind his getaway car, and Drummond fired a few more times when Holliday moved from behind the car. He was shot in the head and killed. Mortin was shot in the foot and survived. He was convicted of second-degree murder because he was with Holliday when Holliday was killed in the commission of a felony.","subjectIds":[107.108]},
{"id":"LM78","hed":"Carjacking suspect killed after firing BB gun at cop","summary":"Florida Highway Patrol trooper Michael Coulter shot and killed a carjacking suspect in Vero Beach following a car chase. Carlos Javier Perez-Alonso, 32, had shoved a woman and taken her car at a Fort Pierce gas station, prompting a police chase north into Indian River County. Coulter was in the lead vehicle. The chase ended when Perez-Alonso drove into the median and jumped out of the car. He had a knife in one hand and a BB gun in the other. He pointed and fired the BB gun at Coulter at about the same time as Coulter fired six rounds from his handgun, killing him.","subjectIds":[106]},
{"id":"LM79","hed":"Major defending home cleared after killing man who barged in","summary":"Off-duty Palm Beach County Maj. Richard Jenkins was getting ready for work when Cesar Maldonado, 22, started banging on his door. The officer opened the door and Maldonado burst in and attacked him. The two were fighting when Jenkins got his department handgun and shot Maldonado once in the head, killing him. The department did not do an internal affairs investigation because prosecutors decided the shooting was off-duty and covered under the castle doctrine.","subjectIds":[105]},
{"id":"LM8","hed":"Officer reprimanded for firing during search of Goodwill store","summary":"Employees of a Goodwill store called Delray Beach police after discovering a door left open. While searching for a potential suspect inside the dark building, officer Roxanne Robertson accidentally pulled the trigger on her handgun, firing one round. Nobody was injured in the incident, and Robertson received a written reprimand.","subjectIds":[]},
{"id":"LM80","hed":"Man holds knife to ex-girlfriend's throat, threatens to kill her if deputies don't kill him; they do","summary":"A woman called police after her daughter was kidnapped at knife-point by her estranged boyfriend. Gleen Gomez, 21, made the ex-girlfriend drive his car, and Palm Beach County deputies stopped it at Forest Hill Boulevard and Jog Road. Gomez held a knife to his ex-girlfriend's throat. Although he told her he wouldn't hurt her, he told deputies he would kill her unless they shot him. Lt. Marcos Martinez took him at his word and counted down, \"three, two, one.\" He, Cpl. Peter Tapia and Cpl. Christopher Wolf each fired into the car, killing Gomez. The ex-girlfriend was not hurt. ","subjectIds":[101]},
{"id":"LM81","hed":"Cops investigating burglary awake man in car, shoot him","summary":"Palm Beach County deputy Marco Flores shot an unarmed man while investigating an early-morning burglary attempt in the West Palm Beach area. Flores and another deputy responded to the caller's home and went next door to a car parked in the driveway. Alens Charles, who lived in the house, was asleep in the front passenger seat and perked up when deputies arrived. Flores said he thought Charles had a gun and fired once, hitting him in the arm. Charles was unarmed.","subjectIds":[98]},
{"id":"LM82","hed":"Man fights off officers, Taser before shot to abdomen","summary":"Riviera Beach officers responded to a Singer Island apartment after Ramon Gomez' mother called 911 after he attacked her. Gomez resisted arrest, at one point sending an officer through a window. A Taser failed to stop him. When he began pummeling an officer with his fists, officer Richard Rott fired once, hitting him in the abdomen. He survived.","subjectIds":[97]},
{"id":"LM83","hed":"Veteran defending home fires on police","summary":"Palm Beach County deputies briefly exchanged gunfire with a 62-year-old Vietnam veteran who suffered from extreme hearing and vision loss. Nobody was hurt in the firefight outside William Rives' west county home. Rives' wife had called 911 claiming her husband beat her and had access to guns. When deputies arrived, she was passed out on the porch. Rives came out with a handgun. Deputies identified themselves and fired on Rives when he pointed a handgun at them. Rives shot back, then went inside. He called 911 reporting strangers on his lawn, and surrendered when he learned they were police. He was arrested on four counts of attempted murder but the charges were dropped.","subjectIds":[91]},
{"id":"LM84","hed":"Man killed outside grocery store when he lifted shirt to reveal knife","summary":"An off-duty Palm Beach County deputy shot a man after he thought the man was going for a gun. Deputy Donald Smith was leaving the King Foods & Meat Bazaar in West Palm Beach when a shopper flagged him down in the parking lot. Smith was in plainclothes but had arrived in his patrol car. The shopper said that Jamil Murray, 28, had a gun in his waistband. Smith approached Murray, a frequent customer at the store, and told him to put his hands up. He then asked Murray if he had a gun. Murray lifted up his shirt and pulled out a knife. Smith said Murray's \"furtive movements\" caused him to fire twice, killing Murray.","subjectIds":[88]},
{"id":"LM85","hed":"Deputy fires blindly into woods,later kills himself","summary":"Palm Beach County deputy Samuel Peixoto might have been disciplined for firing blindly into the woods at a burglary suspect had he not killed himself before the investigation was over. Peixoto responded to a burglary call at the Bushel Stop nursery and heard someone run into the woods behind the store. The deputy said he saw a \"muzzle flash\" and believed a person in the woods was shooting at him. Although he didn't see anyone, he fired 12 times into the woods. Charles Shukas was found hiding in the woods and was arrested for the burglary, but police never found a gun. A few months later, Peixoto shot and killed a man and committed suicide soon after.","subjectIds":[83]},
{"id":"LM86","hed":"Deputy fires at robbery suspect, who escapes unwounded","summary":"Palm Beach County deputy John Barone shot at and missed robbery suspect Jonathan Austin after Austin didn't obey orders to surrender. Austin was later arrested. (Note: Police no longer have the report on this case.)","subjectIds":[82]},
{"id":"LM87","hed":"Police shoot at man suspected of beating his girlfriend","summary":"Palm Beach County deputy Joseph Mack shot at and missed a man after the man struck another deputy with a car. Mack and three other deputies were called to a Wellington home over a report that David Rossi was beating his girlfriend. The deputies surrounded him in his car, but Rossi took off, striking a deputy along the way. He was later arrested. (Note: Police no longer have records on this incident.)","subjectIds":[81]},
{"id":"LM88","hed":"Sergeant meeting man for sex shoots him after he takes his badge","summary":"Palm Beach County Sgt. James Seigfreid initially told police that while visiting a friend, someone stole his wallet and badge and drove away in a car. He said he fired at the car because it drove at him. But detectives eventually concluded that Seigfreid had intended to meet the man, Ira Joe Stuckey, for sex. When Stuckey didn't perform the sex act, Seigfreid chased after him, dropping his badge along the way. Stuckey took the badge and demanded money for it. Seigfreid refused, and when Stuckey drove away, the sergeant fired twice at the vehicle in retaliation, hitting Seigfreid in the arm.","subjectIds":[80]},
{"id":"LM89","hed":"Man shot after he drives toward deputy","summary":"Palm Beach County deputy Christopher Cabrera shot Joshua Jett in the face when Cabrera said Jett drove at him. Cabrera had tried to pull over Jett, but the man wouldn't stop. Jett pulled into an apartment complex parking lot, and Cabrera got out of his patrol car. Jett had no way of escape, so he turned around in his car and drove at the deputy, who shot into the car several times.","subjectIds":[79]},
{"id":"LM9","hed":"Fleeing woman drives into detective, gets shot twice","summary":"Delray Beach police Detective James Wintemute responded to a shoplifting call by stopping the car of fleeing suspect Darlene Rawls at Linton Boulevard and SW 4th Avenue. Wintemute got out of his car and told Rawls to turn off hers. Instead, Rawls backed up and pulled forward to escape, striking the detective in the knee. Wintemute fired his weapon once, striking Rawls in the arm and abdomen. The detective was given a written reprimand for standing in front of Rawls' car and placing himself in a situation where he could be struck.","subjectIds":[218]},
{"id":"LM90","hed":"Man with crowbar accused of breaking into cars shot in the arm","summary":"Palm Beach County deputy Matthew Turpin was patrolling a Lake Park neighborhood on a bike when he noticed Perciel Hamilton trying to break into a car with a crowbar. Hamilton fled, and when Turpin caught up to him, Hamilton refused orders to drop the crowbar, according to police. He raised the crowbar above his head, and Turpin shot him once in the arm.","subjectIds":[78]},
{"id":"LM91","hed":"Deputy shoots man he said pointed gun at him","summary":"Police were called to a Walgreens over a report of an armed robbery, and Palm Beach County deputy Russell Brinson caught up to the suspect, Byron Perez-Leon, nearby. Brinson chased him on foot into an alley, where the deputy said Perez-Leon turned and pointed a gun at him. Brinson fired four times, hitting Perez-Leon three times but he survived. Perez-Leon, who was legally drunk, might have been trying to ditch the weapon -- it was found tossed over a backyard fence next to the alley.","subjectIds":[77]},
{"id":"LM92","hed":"Man who ran stop sign raises gun even though ammo in car, gets shot","summary":"Two Boynton Beach officers patrolling in a car together tried to pull over a car after seeing it fail to completely stop at two stop signs. The car pulled into the driveway of a home, and officer Cory Herny pulled in behind it and got out, expecting the people in the car to flee. One of the passengers, Ruben Estime, got out with a gun, and Herny shot him when he said Estime pointed the gun at him. Estime, who survived, had no intention of shooting the officer, however -- he left the ammunition in the car, fearing he would get in trouble for having a loaded weapon.","subjectIds":[76]},
{"id":"LM93","hed":"Mentally ill man fights officer at burglary scene, is shot in the head","summary":"While at the scene of an apartment burglary, Palm Beach County deputy Ernest Cantu saw someone he had arrested several times before: Tinoris Williams, a mentally ill man who lived next door to the burglarized apartment. Williams asked the burglary victim if someone had broken into her apartment. Cantu told Williams to leave. Nearly two hours later, Williams returned. Cantu followed him inside and told him to get on the floor. Williams instead started fighting with the deputy, and during the struggle Williams grabbed his gun. Cantu fired twice -- the second time into Williams' head, killing him. The gunshot was so close to Cantu's face that the gunpowder burned his eye.","subjectIds":[75]},
{"id":"LM94","hed":"Off-duty cop shoots five times at man armed with wine bottle","summary":"Off-duty Palm Beach County deputy Alex Alfonso shot a man while hanging out at his apartment complex pool. Alfonso said he saw a couple performing a \"sex act\" in the complex's hot tub pool and told them to leave, which they did. Later, Alfonso went back to the pool to smoke a cigar. The couple returned and confronted him. During the exchange, the man, Anthony Ribeiro, raised a wine bottle above his head, Alfonso said. The deputy, fearing Ribeiro would hit him, backed up and shot him five times. He survived.","subjectIds":[74]},
{"id":"LM95","hed":"Naked man attacks elderly man, bites teen in the face, lunges at deputies, who kill him ","summary":"In a bizarre case, a Palm Beach County deputy shot Anesson Joseph, who was naked and attacked two people before he was killed. Joseph, who had no criminal record and was not on drugs, attacked a 66-year-old man, who fought him off with a bottle opener. Later, Joseph attacked an 18-year-old man, punching him and biting him in the face while the younger man stabbed him with a box cutter. When several deputies arrived, Joseph was still naked, sweaty and bent forward with a \"crazed\" look in his eyes. He pointed toward Sgt. Richard Raasch, said, \"I want you,\" and lunged forward. Raasch shot him twice, killing him. It's still unclear why Joseph went on the rampage.","subjectIds":[73]},
{"id":"LM96","hed":"On dead-end street, man starts shooting; deputies return fire, hitting him twice","summary":"Police were called after security officers at an apartment complex spotted a man, later identified as Lance Joseph, with a gun. Joseph got in his car and drove away. Palm Beach County deputies Charles Booth and Corey Oliver spotted the car and followed it down a dead-end street. Although both deputies were in uniform, they were driving an unmarked Jeep Cherokee. Joseph stopped his car and the deputies drove past it and turned around. That's when Joseph, who thought a man by the name of Freddie Carter was after him, got out of his car and started shooting. Joseph said he was shooting into the air; deputies thought he was shooting at them, and they returned fire. Joseph was shot twice. He said he didn't know they were police.","subjectIds":[72]},
{"id":"LM97","hed":"Mentally ill veteran points gun at woman, also points gun at deputies; they kill him","summary":"James Fay, a mentally ill veteran, was drinking at a friend's house when he pulled out a gun and pointed it at his friend's wife, who called 911. After Palm Beach County deputies arrived, Fay came outside and pointed the gun at them. Sgt. Neil Honkala and Heather Kneisley shot and killed him.","subjectIds":[71]},
{"id":"LM98","hed":"SUV passenger points AK-47 at officer; officer kills him","summary":"West Palm Beach police were called to a drive-by shooting that left a woman wounded. When officer Christopher Nebbeling arrived, witnesses said the shooter was in a blue SUV. Nebbeling found the SUV nearby and pursued it until it crashed. The driver got out and ran, the front passenger got out and immediately got on the ground and the backseat passenger, Dimetri Polen, got out with an AK-47. Nebbeling said Polen pointed the gun at him, Nebbeling he fired several times, killing him. The AK-47 was the same gun used in the drive-by shooting.","subjectIds":[70]},
{"id":"LM99","hed":"Just kill me': Man who fatally shot wife reaches for handgun; officer kills him","summary":"Ian Burlakoff shot and killed his wife on A1A following months of a contentious divorce. Boca Raton officer Robert Cohen arrived at the scene and told Burlakoff to get on the ground. Burlakoff did so, then looked up and asked, \"Where's your backup?\" Then, \"Just kill me.\" He reached into his waistband for his handgun and Cohen fired several times, killing him.","subjectIds":[69]}]